CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052.h
    struct {
      __IM  uint32_t RESULT     : 16;           /*!< [15..0] desc RESULT                                                       */
    } RESULT5_f;
  } ;
  
  union {
    __IM  uint32_t RESULT6;                     /*!< (@ 0x00000038) desc RESULT6                                               */
    
    struct {
      __IM  uint32_t RESULT     : 16;           /*!< [15..0] desc RESULT                                                       */
    } RESULT6_f;
  } ;
  
  union {
    __IM  uint32_t RESULT7;                     /*!< (@ 0x0000003C) desc RESULT7                                               */
    
    struct {
      __IM  uint32_t RESULT     : 16;           /*!< [15..0] desc RESULT                                                       */
    } RESULT7_f;
  } ;
  
  union {
    __IM  uint32_t RESULTACC;                   /*!< (@ 0x00000040) desc RESULTACC                                             */
    
    struct {
      __IM  uint32_t RESULT     : 24;           /*!< [23..0] desc RESULT                                                       */
    } RESULTACC_f;
  } ;
  
  union {
    __IOM uint32_t IER;                         /*!< (@ 0x00000044) desc IER                                                   */
    
    struct {
      __IOM uint32_t EOC        : 1;            /*!< [0..0] desc EOC                                                           */
      __IOM uint32_t EOS        : 1;            /*!< [1..1] desc EOS                                                           */
      __IOM uint32_t EOA        : 1;            /*!< [2..2] desc EOA                                                           */
      __IOM uint32_t WDTL       : 1;            /*!< [3..3] desc WDTL                                                          */
      __IOM uint32_t WDTH       : 1;            /*!< [4..4] desc WDTH                                                          */
      __IOM uint32_t WDTR       : 1;            /*!< [5..5] desc WDTR                                                          */
      __IOM uint32_t OVW        : 1;            /*!< [6..6] desc OVW                                                           */
    } IER_f;
  } ;
  
  union {
    __IOM uint32_t ICR;                         /*!< (@ 0x00000048) desc ICR                                                   */
    
    struct {
      __IOM uint32_t EOC        : 1;            /*!< [0..0] desc EOC                                                           */
      __IOM uint32_t EOS        : 1;            /*!< [1..1] desc EOS                                                           */
      __IOM uint32_t EOA        : 1;            /*!< [2..2] desc EOA                                                           */
      __IOM uint32_t WDTL       : 1;            /*!< [3..3] desc WDTL                                                          */
      __IOM uint32_t WDTH       : 1;            /*!< [4..4] desc WDTH                                                          */
      __IOM uint32_t WDTR       : 1;            /*!< [5..5] desc WDTR                                                          */
      __IOM uint32_t OVW        : 1;            /*!< [6..6] desc OVW                                                           */
    } ICR_f;
  } ;
  
  union {
    __IM  uint32_t ISR;                         /*!< (@ 0x0000004C) desc ISR                                                   */
    
    struct {
      __IM  uint32_t EOC        : 1;            /*!< [0..0] desc EOC                                                           */
      __IM  uint32_t EOS        : 1;            /*!< [1..1] desc EOS                                                           */
      __IM  uint32_t EOA        : 1;            /*!< [2..2] desc EOA                                                           */
      __IM  uint32_t WDTL       : 1;            /*!< [3..3] desc WDTL                                                          */
      __IM  uint32_t WDTH       : 1;            /*!< [4..4] desc WDTH                                                          */
      __IM  uint32_t WDTR       : 1;            /*!< [5..5] desc WDTR                                                          */
      __IM  uint32_t OVW        : 1;            /*!< [6..6] desc OVW                                                           */
      __IM  uint32_t READY      : 1;            /*!< [7..7] desc READY                                                         */
    } ISR_f;
  } ;
  
  union {
    __IOM uint32_t SQR0;                        /*!< (@ 0x00000050) desc SQR0                                                  */
    
    struct {
      __IOM uint32_t SQR0       : 4;            /*!< [3..0] desc SQR0                                                          */
      __IOM uint32_t SQR1       : 4;            /*!< [7..4] desc SQR1                                                          */
      __IOM uint32_t SQR2       : 4;            /*!< [11..8] desc SQR2                                                         */
      __IOM uint32_t SQR3       : 4;            /*!< [15..12] desc SQR3                                                        */
      __IOM uint32_t ENS        : 3;            /*!< [18..16] desc ENS                                                         */
    } SQR0_f;
  } ;
  
  union {
    __IOM uint32_t SQR1;                        /*!< (@ 0x00000054) desc SQR1                                                  */
    
    struct {
      __IOM uint32_t SQR4       : 4;            /*!< [3..0] desc SQR4                                                          */
      __IOM uint32_t SQR5       : 4;            /*!< [7..4] desc SQR5                                                          */
      __IOM uint32_t SQR6       : 4;            /*!< [11..8] desc SQR6                                                         */
      __IOM uint32_t SQR7       : 4;            /*!< [15..12] desc SQR7                                                        */
    } SQR1_f;
  } ;
  
  union {
    __IOM uint32_t ALTR;                        /*!< (@ 0x00000058) desc ALTR                                                  */
    
