CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052.h
    struct {
      __IOM uint32_t CH0        : 1;            /*!< [0..0] desc CH0                                                           */
      __IOM uint32_t CH1        : 1;            /*!< [1..1] desc CH1                                                           */
      __IOM uint32_t CH2        : 1;            /*!< [2..2] desc CH2                                                           */
      __IOM uint32_t CH3        : 1;            /*!< [3..3] desc CH3                                                           */
      __IOM uint32_t CH4        : 1;            /*!< [4..4] desc CH4                                                           */
      __IOM uint32_t CH5        : 1;            /*!< [5..5] desc CH5                                                           */
      __IOM uint32_t CH6        : 1;            /*!< [6..6] desc CH6                                                           */
      __IOM uint32_t CH7        : 1;            /*!< [7..7] desc CH7                                                           */
      __IOM uint32_t CH8        : 1;            /*!< [8..8] desc CH8                                                           */
      __IOM uint32_t CH9        : 1;            /*!< [9..9] desc CH9                                                           */
      __IOM uint32_t CH10       : 1;            /*!< [10..10] desc CH10                                                        */
      __IOM uint32_t CH11       : 1;            /*!< [11..11] desc CH11                                                        */
      __IOM uint32_t CH12       : 1;            /*!< [12..12] desc CH12                                                        */
      __IOM uint32_t CH13       : 1;            /*!< [13..13] desc CH13                                                        */
      __IOM uint32_t CH14       : 1;            /*!< [14..14] desc CH14                                                        */
      __IOM uint32_t CH15       : 1;            /*!< [15..15] desc CH15                                                        */
      __IOM uint32_t REPEAT     : 1;            /*!< [16..16] desc REPEAT                                                      */
    } ALTR_f;
  } ;
  
  union {
    __IM  uint32_t RESULT;                      /*!< (@ 0x0000005C) desc RESULT                                                */
    
    struct {
      __IM  uint32_t RESULT     : 16;           /*!< [15..0] desc RESULT                                                       */
    } RESULT_f;
  } ;
} ADC_TypeDef;                                     /*!< Size = 96 (0x60)                                                          */



/* =========================================================================================================================== */
/* ================                                           ATIM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc ATIM (ATIM)
  */

typedef struct {                                /*!< (@ 0x40012C00) ATIM Structure                                             */
  
  union {
    __IOM uint32_t ARR;                         /*!< (@ 0x00000000) desc ARR                                                   */
    
    struct {
      __IOM uint32_t ARR        : 16;           /*!< [15..0] desc ARR                                                          */
    } ARR_f;
  } ;
  
  union {
    __IOM uint32_t CNT;                         /*!< (@ 0x00000004) desc CNT                                                   */
    
    struct {
      __IOM uint32_t CNT        : 16;           /*!< [15..0] desc CNT                                                          */
    } CNT_f;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x0000000C) desc CR                                                    */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
      __IOM uint32_t COMP       : 1;            /*!< [1..1] desc COMP                                                          */
      __IOM uint32_t CT         : 1;            /*!< [2..2] desc CT                                                            */
      __IOM uint32_t PWM2S      : 1;            /*!< [3..3] desc PWM2S                                                         */
      __IOM uint32_t PRS        : 3;            /*!< [6..4] desc PRS                                                           */
      __IOM uint32_t BUFPEN     : 1;            /*!< [7..7] desc BUFPEN                                                        */
      __IM  uint32_t            : 2;
      __IOM uint32_t UIE        : 1;            /*!< [10..10] desc UIE                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t MODE       : 2;            /*!< [13..12] desc MODE                                                        */
      __IOM uint32_t ONESHOT    : 1;            /*!< [14..14] desc ONESHOT                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t OCCS       : 1;            /*!< [16..16] desc OCCS                                                        */
      __IOM uint32_t URS        : 1;            /*!< [17..17] desc URS                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t TIE        : 1;            /*!< [19..19] desc TIE                                                         */
      __IOM uint32_t BIE        : 1;            /*!< [20..20] desc BIE                                                         */
      __IOM uint32_t CISA       : 2;            /*!< [22..21] desc CISA                                                        */
      __IOM uint32_t OCCE       : 1;            /*!< [23..23] desc OCCE                                                        */
      __IOM uint32_t TG         : 1;            /*!< [24..24] desc TG                                                          */
      __IOM uint32_t UG         : 1;            /*!< [25..25] desc UG                                                          */
      __IOM uint32_t BG         : 1;            /*!< [26..26] desc BG                                                          */
      __IOM uint32_t DIR        : 1;            /*!< [27..27] desc DIR                                                         */
      __IOM uint32_t OVE        : 1;            /*!< [28..28] desc OVE                                                         */
      __IOM uint32_t UNDE       : 1;            /*!< [29..29] desc UNDE                                                        */
    } CR_f;
  } ;
  
  union {
    __IM  uint32_t ISR;                         /*!< (@ 0x00000010) desc ISR                                                   */
    
