CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052.h
    struct {
      __IOM uint32_t BKSA       : 2;            /*!< [1..0] desc BKSA                                                          */
      __IOM uint32_t BKSB       : 2;            /*!< [3..2] desc BKSB                                                          */
      __IOM uint32_t CSA        : 1;            /*!< [4..4] desc CSA                                                           */
      __IOM uint32_t CSB        : 1;            /*!< [5..5] desc CSB                                                           */
      __IOM uint32_t BUFEA      : 1;            /*!< [6..6] desc BUFEA                                                         */
      __IOM uint32_t BUFEB      : 1;            /*!< [7..7] desc BUFEB                                                         */
      __IOM uint32_t CIEA       : 1;            /*!< [8..8] desc CIEA                                                          */
      __IOM uint32_t CIEB       : 1;            /*!< [9..9] desc CIEB                                                          */
      __IOM uint32_t CDEA       : 1;            /*!< [10..10] desc CDEA                                                        */
      __IOM uint32_t CDEB       : 1;            /*!< [11..11] desc CDEB                                                        */
      __IOM uint32_t CISB       : 2;            /*!< [13..12] desc CISB                                                        */
      __IOM uint32_t CCGA       : 1;            /*!< [14..14] desc CCGA                                                        */
      __IOM uint32_t CCGB       : 1;            /*!< [15..15] desc CCGB                                                        */
    } CH3CR_f;
  } ;
  
  union {
    __IOM uint32_t DTR;                         /*!< (@ 0x00000030) desc DTR                                                   */
    
    struct {
      __IOM uint32_t DTR        : 8;            /*!< [7..0] desc DTR                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t DTEN       : 1;            /*!< [9..9] desc DTEN                                                          */
      __IOM uint32_t BKE        : 1;            /*!< [10..10] desc BKE                                                         */
      __IOM uint32_t AOE        : 1;            /*!< [11..11] desc AOE                                                         */
      __IOM uint32_t MOE        : 1;            /*!< [12..12] desc MOE                                                         */
      __IOM uint32_t SAFEEN     : 1;            /*!< [13..13] desc SAFEEN                                                      */
      __IOM uint32_t VCE        : 1;            /*!< [14..14] desc VCE                                                         */
    } DTR_f;
  } ;
  
  union {
    __IOM uint32_t RCR;                         /*!< (@ 0x00000034) desc RCR                                                   */
    
    struct {
      __IOM uint32_t RCR        : 8;            /*!< [7..0] desc RCR                                                           */
      __IOM uint32_t OV         : 1;            /*!< [8..8] desc OV                                                            */
      __IOM uint32_t UD         : 1;            /*!< [9..9] desc UD                                                            */
    } RCR_f;
  } ;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t CH1CCRA;                     /*!< (@ 0x0000003C) desc CH1CCRA                                               */
    
    struct {
      __IOM uint32_t CCR1A      : 16;           /*!< [15..0] desc CCR1A                                                        */
    } CH1CCRA_f;
  } ;
  
  union {
    __IOM uint32_t CH1CCRB;                     /*!< (@ 0x00000040) desc CH1CCRB                                               */
    
    struct {
      __IOM uint32_t CCR1B      : 16;           /*!< [15..0] desc CCR1B                                                        */
    } CH1CCRB_f;
  } ;
  
  union {
    __IOM uint32_t CH2CCRA;                     /*!< (@ 0x00000044) desc CH2CCRA                                               */
    
    struct {
      __IOM uint32_t CCR2A      : 16;           /*!< [15..0] desc CCR2A                                                        */
    } CH2CCRA_f;
  } ;
  
  union {
    __IOM uint32_t CH2CCRB;                     /*!< (@ 0x00000048) desc CH2CCRB                                               */
    
    struct {
      __IOM uint32_t CCR2B      : 16;           /*!< [15..0] desc CCR2B                                                        */
    } CH2CCRB_f;
  } ;
  
  union {
    __IOM uint32_t CH3CCRA;                     /*!< (@ 0x0000004C) desc CH3CCRA                                               */
    
    struct {
      __IOM uint32_t CCR3A      : 16;           /*!< [15..0] desc CCR3A                                                        */
    } CH3CCRA_f;
  } ;
  
  union {
    __IOM uint32_t CH3CCRB;                     /*!< (@ 0x00000050) desc CH3CCRB                                               */
    
    struct {
      __IOM uint32_t CCR3B      : 16;           /*!< [15..0] desc CCR3B                                                        */
    } CH3CCRB_f;
  } ;
  
  union {
    __IOM uint32_t CH4CCR;                      /*!< (@ 0x00000054) desc CH4CCR                                                */
    
    struct {
      __IOM uint32_t CCR4       : 16;           /*!< [15..0] desc CCR4                                                         */
    } CH4CCR_f;
  } ;
  
  union {
    __IOM uint32_t CH4CR;                       /*!< (@ 0x00000058) desc CH4CR                                                 */
    
    struct {
      __IOM uint32_t BUFE       : 1;            /*!< [0..0] desc BUFE                                                          */
      __IOM uint32_t CIE        : 1;            /*!< [1..1] desc CIE                                                           */
      __IOM uint32_t CDE        : 1;            /*!< [2..2] desc CDE                                                           */
      __IOM uint32_t CIS        : 2;            /*!< [4..3] desc CIS                                                           */
      __IOM uint32_t C4EN       : 1;            /*!< [5..5] desc C4EN                                                          */
    } CH4CR_f;
  } ;
} ATIM_TypeDef;                                    /*!< Size = 92 (0x5c)                                                          */



/* =========================================================================================================================== */
/* ================                                         AUTOTRIM                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief desc AUTOTRIM (AUTOTRIM)
  */

