CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052.h
    struct {
      __IOM uint32_t BRR0       : 1;            /*!< [0..0] desc BRR0                                                          */
      __IOM uint32_t BRR1       : 1;            /*!< [1..1] desc BRR1                                                          */
      __IOM uint32_t BRR2       : 1;            /*!< [2..2] desc BRR2                                                          */
      __IOM uint32_t BRR3       : 1;            /*!< [3..3] desc BRR3                                                          */
      __IOM uint32_t BRR4       : 1;            /*!< [4..4] desc BRR4                                                          */
      __IOM uint32_t BRR5       : 1;            /*!< [5..5] desc BRR5                                                          */
      __IOM uint32_t BRR6       : 1;            /*!< [6..6] desc BRR6                                                          */
      __IOM uint32_t BRR7       : 1;            /*!< [7..7] desc BRR7                                                          */
      __IOM uint32_t BRR8       : 1;            /*!< [8..8] desc BRR8                                                          */
      __IOM uint32_t BRR9       : 1;            /*!< [9..9] desc BRR9                                                          */
      __IOM uint32_t BRR10      : 1;            /*!< [10..10] desc BRR10                                                       */
      __IOM uint32_t BRR11      : 1;            /*!< [11..11] desc BRR11                                                       */
      __IOM uint32_t BRR12      : 1;            /*!< [12..12] desc BRR12                                                       */
      __IOM uint32_t BRR13      : 1;            /*!< [13..13] desc BRR13                                                       */
      __IOM uint32_t BRR14      : 1;            /*!< [14..14] desc BRR14                                                       */
      __IOM uint32_t BRR15      : 1;            /*!< [15..15] desc BRR15                                                       */
    } BRR_f;
  } ;
  
  union {
    __IOM uint32_t BSRR;                        /*!< (@ 0x0000005C) desc BSRR                                                  */
    
    struct {
      __IOM uint32_t BSS0       : 1;            /*!< [0..0] desc BSS0                                                          */
      __IOM uint32_t BSS1       : 1;            /*!< [1..1] desc BSS1                                                          */
      __IOM uint32_t BSS2       : 1;            /*!< [2..2] desc BSS2                                                          */
      __IOM uint32_t BSS3       : 1;            /*!< [3..3] desc BSS3                                                          */
      __IOM uint32_t BSS4       : 1;            /*!< [4..4] desc BSS4                                                          */
      __IOM uint32_t BSS5       : 1;            /*!< [5..5] desc BSS5                                                          */
      __IOM uint32_t BSS6       : 1;            /*!< [6..6] desc BSS6                                                          */
      __IOM uint32_t BSS7       : 1;            /*!< [7..7] desc BSS7                                                          */
      __IOM uint32_t BSS8       : 1;            /*!< [8..8] desc BSS8                                                          */
      __IOM uint32_t BSS9       : 1;            /*!< [9..9] desc BSS9                                                          */
      __IOM uint32_t BSS10      : 1;            /*!< [10..10] desc BSS10                                                       */
      __IOM uint32_t BSS11      : 1;            /*!< [11..11] desc BSS11                                                       */
      __IOM uint32_t BSS12      : 1;            /*!< [12..12] desc BSS12                                                       */
      __IOM uint32_t BSS13      : 1;            /*!< [13..13] desc BSS13                                                       */
      __IOM uint32_t BSS14      : 1;            /*!< [14..14] desc BSS14                                                       */
      __IOM uint32_t BSS15      : 1;            /*!< [15..15] desc BSS15                                                       */
      __IOM uint32_t BRR0       : 1;            /*!< [16..16] desc BRR0                                                        */
      __IOM uint32_t BRR1       : 1;            /*!< [17..17] desc BRR1                                                        */
      __IOM uint32_t BRR2       : 1;            /*!< [18..18] desc BRR2                                                        */
      __IOM uint32_t BRR3       : 1;            /*!< [19..19] desc BRR3                                                        */
      __IOM uint32_t BRR4       : 1;            /*!< [20..20] desc BRR4                                                        */
      __IOM uint32_t BRR5       : 1;            /*!< [21..21] desc BRR5                                                        */
      __IOM uint32_t BRR6       : 1;            /*!< [22..22] desc BRR6                                                        */
      __IOM uint32_t BRR7       : 1;            /*!< [23..23] desc BRR7                                                        */
      __IOM uint32_t BRR8       : 1;            /*!< [24..24] desc BRR8                                                        */
      __IOM uint32_t BRR9       : 1;            /*!< [25..25] desc BRR9                                                        */
      __IOM uint32_t BRR10      : 1;            /*!< [26..26] desc BRR10                                                       */
      __IOM uint32_t BRR11      : 1;            /*!< [27..27] desc BRR11                                                       */
      __IOM uint32_t BRR12      : 1;            /*!< [28..28] desc BRR12                                                       */
      __IOM uint32_t BRR13      : 1;            /*!< [29..29] desc BRR13                                                       */
      __IOM uint32_t BRR14      : 1;            /*!< [30..30] desc BRR14                                                       */
      __IOM uint32_t BRR15      : 1;            /*!< [31..31] desc BRR15                                                       */
    } BSRR_f;
  } ;
  
  union {
    __IOM uint32_t TOG;                         /*!< (@ 0x00000060) desc TOG                                                   */
    
