CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052.h
    struct {
      __IOM uint32_t PSC        : 16;           /*!< [15..0] desc PSC                                                          */
    } PSC_f;
  } ;
  __IM  uint32_t  RESERVED1[2];
  
  union {
    __IOM uint32_t DMA;                         /*!< (@ 0x00000340) desc DMA                                                   */
    
    struct {
      __IOM uint32_t OV         : 1;            /*!< [0..0] desc OV                                                            */
      __IOM uint32_t TRS        : 1;            /*!< [1..1] desc TRS                                                           */
      __IOM uint32_t CC1        : 1;            /*!< [2..2] desc CC1                                                           */
      __IOM uint32_t CC2        : 1;            /*!< [3..3] desc CC2                                                           */
      __IOM uint32_t CC3        : 1;            /*!< [4..4] desc CC3                                                           */
      __IOM uint32_t CC4        : 1;            /*!< [5..5] desc CC4                                                           */
    } DMA_f;
  } ;
} GTIM_TypeDef;                                    /*!< Size = 836 (0x344)                                                        */



/* =========================================================================================================================== */
/* ================                                           I2C1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc I2C1 (I2C1)
  */

typedef struct {                                /*!< (@ 0x40005400) I2C1 Structure                                             */
  
  union {
    __IOM uint32_t BRREN;                       /*!< (@ 0x00000000) desc BRREN                                                 */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
    } BRREN_f;
  } ;
  
  union {
    __IOM uint32_t BRR;                         /*!< (@ 0x00000004) desc BRR                                                   */
    
    struct {
      __IOM uint32_t BRR        : 8;            /*!< [7..0] desc BRR                                                           */
    } BRR_f;
  } ;
  
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000008) desc CR                                                    */
    
    struct {
      __IOM uint32_t FLT        : 1;            /*!< [0..0] desc FLT                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t AA         : 1;            /*!< [2..2] desc AA                                                            */
      __IOM uint32_t SI         : 1;            /*!< [3..3] desc SI                                                            */
      __IOM uint32_t STO        : 1;            /*!< [4..4] desc STO                                                           */
      __IOM uint32_t STA        : 1;            /*!< [5..5] desc STA                                                           */
      __IOM uint32_t EN         : 1;            /*!< [6..6] desc EN                                                            */
    } CR_f;
  } ;
  
  union {
    __IOM uint32_t DR;                          /*!< (@ 0x0000000C) desc DR                                                    */
    
    struct {
      __IOM uint32_t DR         : 8;            /*!< [7..0] desc DR                                                            */
    } DR_f;
  } ;
  
  union {
    __IOM uint32_t ADDR0;                       /*!< (@ 0x00000010) desc ADDR0                                                 */
    
    struct {
      __IOM uint32_t GC         : 1;            /*!< [0..0] desc GC                                                            */
      __IOM uint32_t ADDR0      : 7;            /*!< [7..1] desc ADDR0                                                         */
    } ADDR0_f;
  } ;
  
  union {
    __IM  uint32_t STAT;                        /*!< (@ 0x00000014) desc STAT                                                  */
    
    struct {
      __IM  uint32_t STAT       : 8;            /*!< [7..0] desc STAT                                                          */
    } STAT_f;
  } ;
  __IM  uint32_t  RESERVED[2];
  
  union {
    __IOM uint32_t ADDR1;                       /*!< (@ 0x00000020) desc ADDR1                                                 */
    
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t ADDR1      : 7;            /*!< [7..1] desc ADDR1                                                         */
    } ADDR1_f;
  } ;
  
  union {
    __IOM uint32_t ADDR2;                       /*!< (@ 0x00000024) desc ADDR2                                                 */
    
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t ADDR2      : 7;            /*!< [7..1] desc ADDR2                                                         */
    } ADDR2_f;
  } ;
  
  union {
    __IM  uint32_t MATCH;                       /*!< (@ 0x00000028) desc MATCH                                                 */
    
    struct {
      __IM  uint32_t ADDR0      : 1;            /*!< [0..0] desc ADDR0                                                         */
      __IM  uint32_t ADDR1      : 1;            /*!< [1..1] desc ADDR1                                                         */
      __IM  uint32_t ADDR2      : 1;            /*!< [2..2] desc ADDR2                                                         */
    } MATCH_f;
  } ;
} I2C_TypeDef;                                     /*!< Size = 44 (0x2c)                                                          */



/* =========================================================================================================================== */
/* ================                                           IWDT                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc IWDT (IWDT)
  */

typedef struct {                                /*!< (@ 0x40003000) IWDT Structure                                             */
  
  union {
    __OM  uint32_t KR;                          /*!< (@ 0x00000000) desc KR                                                    */
    
