CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052.h
    struct {
      __IOM uint32_t SEG0       : 1;            /*!< [0..0] desc SEG0                                                          */
      __IOM uint32_t SEG1       : 1;            /*!< [1..1] desc SEG1                                                          */
      __IOM uint32_t SEG2       : 1;            /*!< [2..2] desc SEG2                                                          */
      __IOM uint32_t SEG3       : 1;            /*!< [3..3] desc SEG3                                                          */
      __IOM uint32_t SEG4       : 1;            /*!< [4..4] desc SEG4                                                          */
      __IOM uint32_t SEG5       : 1;            /*!< [5..5] desc SEG5                                                          */
      __IOM uint32_t SEG6       : 1;            /*!< [6..6] desc SEG6                                                          */
      __IOM uint32_t SEG7       : 1;            /*!< [7..7] desc SEG7                                                          */
      __IOM uint32_t SEG8       : 1;            /*!< [8..8] desc SEG8                                                          */
      __IOM uint32_t SEG9       : 1;            /*!< [9..9] desc SEG9                                                          */
      __IOM uint32_t SEG10      : 1;            /*!< [10..10] desc SEG10                                                       */
      __IOM uint32_t SEG11      : 1;            /*!< [11..11] desc SEG11                                                       */
      __IOM uint32_t SEG12      : 1;            /*!< [12..12] desc SEG12                                                       */
      __IOM uint32_t SEG13      : 1;            /*!< [13..13] desc SEG13                                                       */
      __IOM uint32_t SEG14      : 1;            /*!< [14..14] desc SEG14                                                       */
      __IOM uint32_t SEG15      : 1;            /*!< [15..15] desc SEG15                                                       */
      __IOM uint32_t SEG16      : 1;            /*!< [16..16] desc SEG16                                                       */
      __IOM uint32_t SEG17      : 1;            /*!< [17..17] desc SEG17                                                       */
      __IOM uint32_t SEG18      : 1;            /*!< [18..18] desc SEG18                                                       */
      __IOM uint32_t SEG19      : 1;            /*!< [19..19] desc SEG19                                                       */
      __IOM uint32_t SEG20      : 1;            /*!< [20..20] desc SEG20                                                       */
      __IOM uint32_t SEG21      : 1;            /*!< [21..21] desc SEG21                                                       */
      __IOM uint32_t SEG22      : 1;            /*!< [22..22] desc SEG22                                                       */
      __IOM uint32_t SEG23      : 1;            /*!< [23..23] desc SEG23                                                       */
      __IOM uint32_t SEG24VLCD1 : 1;            /*!< [24..24] desc SEG24VLCD1                                                  */
      __IOM uint32_t SEG25VLCD2 : 1;            /*!< [25..25] desc SEG25VLCD2                                                  */
      __IOM uint32_t SEG26VLCD3 : 1;            /*!< [26..26] desc SEG26VLCD3                                                  */
      __IOM uint32_t SEG27VLCD4 : 1;            /*!< [27..27] desc SEG27VLCD4                                                  */
      __IOM uint32_t SEG28COM7  : 1;            /*!< [28..28] desc SEG28COM7                                                   */
      __IOM uint32_t SEG29COM6  : 1;            /*!< [29..29] desc SEG29COM6                                                   */
      __IOM uint32_t SEG30COM5  : 1;            /*!< [30..30] desc SEG30COM5                                                   */
      __IOM uint32_t SEG31COM4  : 1;            /*!< [31..31] desc SEG31COM4                                                   */
    } PINEN1_f;
  } ;
  
  union {
    __IOM uint32_t PINEN2;                      /*!< (@ 0x00000010) desc PINEN2                                                */
    
    struct {
      __IOM uint32_t SEG32      : 1;            /*!< [0..0] desc SEG32                                                         */
      __IOM uint32_t SEG33      : 1;            /*!< [1..1] desc SEG33                                                         */
      __IOM uint32_t SEG34      : 1;            /*!< [2..2] desc SEG34                                                         */
      __IOM uint32_t SEG35      : 1;            /*!< [3..3] desc SEG35                                                         */
      __IM  uint32_t            : 16;
      __IOM uint32_t SEG52      : 1;            /*!< [20..20] desc SEG52                                                       */
      __IOM uint32_t SEG53      : 1;            /*!< [21..21] desc SEG53                                                       */
      __IOM uint32_t SEG54      : 1;            /*!< [22..22] desc SEG54                                                       */
      __IOM uint32_t SEG55      : 1;            /*!< [23..23] desc SEG55                                                       */
      __IOM uint32_t COM0       : 1;            /*!< [24..24] desc COM0                                                        */
      __IOM uint32_t COM1       : 1;            /*!< [25..25] desc COM1                                                        */
      __IOM uint32_t COM2       : 1;            /*!< [26..26] desc COM2                                                        */
      __IOM uint32_t COM3       : 1;            /*!< [27..27] desc COM3                                                        */
      __IOM uint32_t MUX        : 1;            /*!< [28..28] desc MUX                                                         */
    } PINEN2_f;
  } ;
  __IM  uint32_t  RESERVED[11];
  
  union {
    __IOM uint32_t RAM[14];
    struct{
    union{
    __IOM uint32_t RAM0;                        /*!< (@ 0x00000040) desc RAM0                                                  */
    
