CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052.h
    struct {
      __IOM uint32_t D0         : 1;            /*!< [0..0] desc D0                                                            */
      __IOM uint32_t D1         : 1;            /*!< [1..1] desc D1                                                            */
      __IOM uint32_t D2         : 1;            /*!< [2..2] desc D2                                                            */
      __IOM uint32_t D3         : 1;            /*!< [3..3] desc D3                                                            */
      __IOM uint32_t D4         : 1;            /*!< [4..4] desc D4                                                            */
      __IOM uint32_t D5         : 1;            /*!< [5..5] desc D5                                                            */
      __IOM uint32_t D6         : 1;            /*!< [6..6] desc D6                                                            */
      __IOM uint32_t D7         : 1;            /*!< [7..7] desc D7                                                            */
      __IOM uint32_t D8         : 1;            /*!< [8..8] desc D8                                                            */
      __IOM uint32_t D9         : 1;            /*!< [9..9] desc D9                                                            */
      __IOM uint32_t D10        : 1;            /*!< [10..10] desc D10                                                         */
      __IOM uint32_t D11        : 1;            /*!< [11..11] desc D11                                                         */
      __IOM uint32_t D12        : 1;            /*!< [12..12] desc D12                                                         */
      __IOM uint32_t D13        : 1;            /*!< [13..13] desc D13                                                         */
      __IOM uint32_t D14        : 1;            /*!< [14..14] desc D14                                                         */
      __IOM uint32_t D15        : 1;            /*!< [15..15] desc D15                                                         */
      __IOM uint32_t D16        : 1;            /*!< [16..16] desc D16                                                         */
      __IOM uint32_t D17        : 1;            /*!< [17..17] desc D17                                                         */
      __IOM uint32_t D18        : 1;            /*!< [18..18] desc D18                                                         */
      __IOM uint32_t D19        : 1;            /*!< [19..19] desc D19                                                         */
      __IOM uint32_t D20        : 1;            /*!< [20..20] desc D20                                                         */
      __IOM uint32_t D21        : 1;            /*!< [21..21] desc D21                                                         */
      __IOM uint32_t D22        : 1;            /*!< [22..22] desc D22                                                         */
      __IOM uint32_t D23        : 1;            /*!< [23..23] desc D23                                                         */
      __IOM uint32_t D24        : 1;            /*!< [24..24] desc D24                                                         */
      __IOM uint32_t D25        : 1;            /*!< [25..25] desc D25                                                         */
      __IOM uint32_t D26        : 1;            /*!< [26..26] desc D26                                                         */
      __IOM uint32_t D27        : 1;            /*!< [27..27] desc D27                                                         */
      __IOM uint32_t D28        : 1;            /*!< [28..28] desc D28                                                         */
      __IOM uint32_t D29        : 1;            /*!< [29..29] desc D29                                                         */
      __IOM uint32_t D30        : 1;            /*!< [30..30] desc D30                                                         */
      __IOM uint32_t D31        : 1;            /*!< [31..31] desc D31                                                         */
    } RAM8_f;
  } ;
  
  union {
    __IOM uint32_t RAM9;                        /*!< (@ 0x00000064) desc RAM9                                                  */
    
    struct {
      __IOM uint32_t D0         : 1;            /*!< [0..0] desc D0                                                            */
      __IOM uint32_t D1         : 1;            /*!< [1..1] desc D1                                                            */
      __IOM uint32_t D2         : 1;            /*!< [2..2] desc D2                                                            */
      __IOM uint32_t D3         : 1;            /*!< [3..3] desc D3                                                            */
      __IOM uint32_t D4         : 1;            /*!< [4..4] desc D4                                                            */
      __IOM uint32_t D5         : 1;            /*!< [5..5] desc D5                                                            */
      __IOM uint32_t D6         : 1;            /*!< [6..6] desc D6                                                            */
      __IOM uint32_t D7         : 1;            /*!< [7..7] desc D7                                                            */
      __IOM uint32_t D8         : 1;            /*!< [8..8] desc D8                                                            */
      __IOM uint32_t D9         : 1;            /*!< [9..9] desc D9                                                            */
      __IOM uint32_t D10        : 1;            /*!< [10..10] desc D10                                                         */
      __IOM uint32_t D11        : 1;            /*!< [11..11] desc D11                                                         */
      __IOM uint32_t D12        : 1;            /*!< [12..12] desc D12                                                         */
      __IOM uint32_t D13        : 1;            /*!< [13..13] desc D13                                                         */
      __IOM uint32_t D14        : 1;            /*!< [14..14] desc D14                                                         */
      __IOM uint32_t D15        : 1;            /*!< [15..15] desc D15                                                         */
      __IOM uint32_t D16        : 1;            /*!< [16..16] desc D16                                                         */
      __IOM uint32_t D17        : 1;            /*!< [17..17] desc D17                                                         */
      __IOM uint32_t D18        : 1;            /*!< [18..18] desc D18                                                         */
      __IOM uint32_t D19        : 1;            /*!< [19..19] desc D19                                                         */
      __IOM uint32_t D20        : 1;            /*!< [20..20] desc D20                                                         */
      __IOM uint32_t D21        : 1;            /*!< [21..21] desc D21                                                         */
      __IOM uint32_t D22        : 1;            /*!< [22..22] desc D22                                                         */
      __IOM uint32_t D23        : 1;            /*!< [23..23] desc D23                                                         */
      __IOM uint32_t D24        : 1;            /*!< [24..24] desc D24                                                         */
      __IOM uint32_t D25        : 1;            /*!< [25..25] desc D25                                                         */
      __IOM uint32_t D26        : 1;            /*!< [26..26] desc D26                                                         */
      __IOM uint32_t D27        : 1;            /*!< [27..27] desc D27                                                         */
      __IOM uint32_t D28        : 1;            /*!< [28..28] desc D28                                                         */
      __IOM uint32_t D29        : 1;            /*!< [29..29] desc D29                                                         */
      __IOM uint32_t D30        : 1;            /*!< [30..30] desc D30                                                         */
      __IOM uint32_t D31        : 1;            /*!< [31..31] desc D31                                                         */
    } RAM9_f;
  } ;
  
  union {
    __IOM uint32_t RAM10;                       /*!< (@ 0x00000068) desc RAM10                                                 */
    
