CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052.h
    struct {
      __IM  uint32_t CMPM       : 1;            /*!< [0..0] desc CMPM                                                          */
      __IM  uint32_t ARRM       : 1;            /*!< [1..1] desc ARRM                                                          */
      __IM  uint32_t EXTTRIG    : 1;            /*!< [2..2] desc EXTTRIG                                                       */
      __IM  uint32_t CMPOK      : 1;            /*!< [3..3] desc CMPOK                                                         */
      __IM  uint32_t ARROK      : 1;            /*!< [4..4] desc ARROK                                                         */
      __IM  uint32_t UP         : 1;            /*!< [5..5] desc UP                                                            */
      __IM  uint32_t DOWN       : 1;            /*!< [6..6] desc DOWN                                                          */
      __IM  uint32_t DIR        : 2;            /*!< [8..7] desc DIR                                                           */
    } ISR_f;
  } ;
  
  union {
    __IOM uint32_t ICR;                         /*!< (@ 0x00000004) desc ICR                                                   */
    
    struct {
      __IOM uint32_t CMPM       : 1;            /*!< [0..0] desc CMPM                                                          */
      __IOM uint32_t ARRM       : 1;            /*!< [1..1] desc ARRM                                                          */
      __IOM uint32_t EXTTRIG    : 1;            /*!< [2..2] desc EXTTRIG                                                       */
      __IOM uint32_t CMPOK      : 1;            /*!< [3..3] desc CMPOK                                                         */
      __IOM uint32_t ARROK      : 1;            /*!< [4..4] desc ARROK                                                         */
      __IOM uint32_t UP         : 1;            /*!< [5..5] desc UP                                                            */
      __IOM uint32_t DOWN       : 1;            /*!< [6..6] desc DOWN                                                          */
    } ICR_f;
  } ;
  
  union {
    __IOM uint32_t IER;                         /*!< (@ 0x00000008) desc IER                                                   */
    
    struct {
      __IOM uint32_t CMPM       : 1;            /*!< [0..0] desc CMPM                                                          */
      __IOM uint32_t ARRM       : 1;            /*!< [1..1] desc ARRM                                                          */
      __IOM uint32_t EXTTRIG    : 1;            /*!< [2..2] desc EXTTRIG                                                       */
      __IOM uint32_t CMPOK      : 1;            /*!< [3..3] desc CMPOK                                                         */
      __IOM uint32_t ARROK      : 1;            /*!< [4..4] desc ARROK                                                         */
      __IOM uint32_t UP         : 1;            /*!< [5..5] desc UP                                                            */
      __IOM uint32_t DOWN       : 1;            /*!< [6..6] desc DOWN                                                          */
    } IER_f;
  } ;
  
  union {
    __IOM uint32_t CFGR;                        /*!< (@ 0x0000000C) desc CFGR                                                  */
    
    struct {
      __IOM uint32_t CKSEL      : 1;            /*!< [0..0] desc CKSEL                                                         */
      __IOM uint32_t ENCMD_CKPOL : 2;           /*!< [2..1] desc ENCMD_CKPOL                                                   */
      __IOM uint32_t CHFLT      : 2;            /*!< [4..3] desc CHFLT                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t TRIGFLT    : 2;            /*!< [7..6] desc TRIGFLT                                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t PRS        : 3;            /*!< [11..9] desc PRS                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t TRIGSEL    : 3;            /*!< [15..13] desc TRIGSEL                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t TRIGEN     : 2;            /*!< [18..17] desc TRIGEN                                                      */
      __IOM uint32_t TIMOUT     : 1;            /*!< [19..19] desc TIMOUT                                                      */
      __IOM uint32_t WAVE       : 1;            /*!< [20..20] desc WAVE                                                        */
      __IOM uint32_t WAVPOL     : 1;            /*!< [21..21] desc WAVPOL                                                      */
      __IOM uint32_t PRELOAD    : 1;            /*!< [22..22] desc PRELOAD                                                     */
      __IOM uint32_t COUNTMD    : 1;            /*!< [23..23] desc COUNTMD                                                     */
      __IOM uint32_t ENC        : 1;            /*!< [24..24] desc ENC                                                         */
      __IOM uint32_t ICLKSRC    : 2;            /*!< [26..25] desc ICLKSRC                                                     */
    } CFGR_f;
  } ;
  
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000010) desc CR                                                    */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
      __IOM uint32_t SNGSTART   : 1;            /*!< [1..1] desc SNGSTART                                                      */
      __IOM uint32_t CNTSTART   : 1;            /*!< [2..2] desc CNTSTART                                                      */
      __IOM uint32_t SRST       : 1;            /*!< [3..3] desc SRST                                                          */
      __IOM uint32_t ARST       : 1;            /*!< [4..4] desc ARST                                                          */
    } CR_f;
  } ;
  
  union {
    __IOM uint32_t CMP;                         /*!< (@ 0x00000014) desc CMP                                                   */
    
