CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052.h
    struct {
      __IOM uint32_t HSIRDY     : 1;            /*!< [0..0] desc HSIRDY                                                        */
      __IOM uint32_t HSERDY     : 1;            /*!< [1..1] desc HSERDY                                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t LSIRDY     : 1;            /*!< [3..3] desc LSIRDY                                                        */
      __IOM uint32_t LSERDY     : 1;            /*!< [4..4] desc LSERDY                                                        */
      __IOM uint32_t LSEFAIL    : 1;            /*!< [5..5] desc LSEFAIL                                                       */
      __IOM uint32_t HSEFAIL    : 1;            /*!< [6..6] desc HSEFAIL                                                       */
      __IOM uint32_t LSEFAULT   : 1;            /*!< [7..7] desc LSEFAULT                                                      */
      __IOM uint32_t HSEFAULT   : 1;            /*!< [8..8] desc HSEFAULT                                                      */
    } ICR_f;
  } ;
  
  union {
    __IOM uint32_t HSI;                         /*!< (@ 0x00000018) desc HSI                                                   */
    
    struct {
      __IOM uint32_t TRIM       : 11;           /*!< [10..0] desc TRIM                                                         */
      __IOM uint32_t DIV        : 4;            /*!< [14..11] desc DIV                                                         */
      __IM  uint32_t STABLE     : 1;            /*!< [15..15] desc STABLE                                                      */
    } HSI_f;
  } ;
  
  union {
    __IOM uint32_t HSE;                         /*!< (@ 0x0000001C) desc HSE                                                   */
    
    struct {
      __IOM uint32_t DRIVER     : 2;            /*!< [1..0] desc DRIVER                                                        */
      __IOM uint32_t FREQRANGE  : 2;            /*!< [3..2] desc FREQRANGE                                                     */
      __IOM uint32_t WAITCYCLE  : 2;            /*!< [5..4] desc WAITCYCLE                                                     */
      __IOM uint32_t MODE       : 1;            /*!< [6..6] desc MODE                                                          */
      __IOM uint32_t FLT        : 1;            /*!< [7..7] desc FLT                                                           */
      __IOM uint32_t DETCNT     : 11;           /*!< [18..8] desc DETCNT                                                       */
      __IM  uint32_t STABLE     : 1;            /*!< [19..19] desc STABLE                                                      */
      __IOM uint32_t PDRIVER    : 2;            /*!< [21..20] desc PDRIVER                                                     */
      __IOM uint32_t PFREQRANGE : 2;            /*!< [23..22] desc PFREQRANGE                                                  */
    } HSE_f;
  } ;
  
  union {
    __IOM uint32_t LSI;                         /*!< (@ 0x00000020) desc LSI                                                   */
    
    struct {
      __IOM uint32_t TRIM       : 10;           /*!< [9..0] desc TRIM                                                          */
      __IOM uint32_t WAITCYCLE  : 2;            /*!< [11..10] desc WAITCYCLE                                                   */
      __IM  uint32_t            : 3;
      __IM  uint32_t STABLE     : 1;            /*!< [15..15] desc STABLE                                                      */
    } LSI_f;
  } ;
  
  union {
    __IOM uint32_t LSE;                         /*!< (@ 0x00000024) desc LSE                                                   */
    
    struct {
      __IOM uint32_t DRIVER     : 2;            /*!< [1..0] desc DRIVER                                                        */
      __IOM uint32_t AMP        : 2;            /*!< [3..2] desc AMP                                                           */
      __IOM uint32_t WAITCYCLE  : 2;            /*!< [5..4] desc WAITCYCLE                                                     */
      __IOM uint32_t MODE       : 1;            /*!< [6..6] desc MODE                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t PDRIVER    : 2;            /*!< [9..8] desc PDRIVER                                                       */
      __IOM uint32_t PAMP       : 2;            /*!< [11..10] desc PAMP                                                        */
      __IM  uint32_t            : 3;
      __IM  uint32_t STABLE     : 1;            /*!< [15..15] desc STABLE                                                      */
    } LSE_f;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t DEBUG;                       /*!< (@ 0x0000002C) desc DEBUG                                                 */
    
    struct {
      __IOM uint32_t ATIM       : 1;            /*!< [0..0] desc ATIM                                                          */
      __IOM uint32_t GTIM1      : 1;            /*!< [1..1] desc GTIM1                                                         */
      __IOM uint32_t GTIM2      : 1;            /*!< [2..2] desc GTIM2                                                         */
      __IOM uint32_t GTIM3      : 1;            /*!< [3..3] desc GTIM3                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t BTIM123    : 1;            /*!< [5..5] desc BTIM123                                                       */
      __IOM uint32_t AUTOTRIM   : 1;            /*!< [6..6] desc AUTOTRIM                                                      */
      __IM  uint32_t            : 1;
      __IOM uint32_t RTC        : 1;            /*!< [8..8] desc RTC                                                           */
      __IOM uint32_t IWDT       : 1;            /*!< [9..9] desc IWDT                                                          */
      __IOM uint32_t WWDT       : 1;            /*!< [10..10] desc WWDT                                                        */
      __IOM uint32_t LPTIM      : 1;            /*!< [11..11] desc LPTIM                                                       */
    } DEBUG_f;
  } ;
  
  union {
    __IOM uint32_t AHBEN;                       /*!< (@ 0x00000030) desc AHBEN                                                 */
    
