CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052.h
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t GTIM1      : 1;            /*!< [1..1] desc GTIM1                                                         */
      __IOM uint32_t GTIM2      : 1;            /*!< [2..2] desc GTIM2                                                         */
      __IOM uint32_t RTC        : 1;            /*!< [3..3] desc RTC                                                           */
      __IOM uint32_t WWDT       : 1;            /*!< [4..4] desc WWDT                                                          */
      __IOM uint32_t IWDT       : 1;            /*!< [5..5] desc IWDT                                                          */
      __IOM uint32_t SPI2       : 1;            /*!< [6..6] desc SPI2                                                          */
      __IOM uint32_t UART2      : 1;            /*!< [7..7] desc UART2                                                         */
      __IOM uint32_t UART3      : 1;            /*!< [8..8] desc UART3                                                         */
      __IM  uint32_t            : 2;
      __IOM uint32_t I2C1       : 1;            /*!< [11..11] desc I2C1                                                        */
      __IOM uint32_t I2C2       : 1;            /*!< [12..12] desc I2C2                                                        */
      __IOM uint32_t LCD        : 1;            /*!< [13..13] desc LCD                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t LPTIM      : 1;            /*!< [15..15] desc LPTIM                                                       */
    } APBRST1_f;
  } ;
  
  union {
    __IOM uint32_t RESETFLAG;                   /*!< (@ 0x0000004C) desc RESETFLAG                                             */
    
    struct {
      __IOM uint32_t POR        : 1;            /*!< [0..0] desc POR                                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t LVD        : 1;            /*!< [3..3] desc LVD                                                           */
      __IOM uint32_t IWDT       : 1;            /*!< [4..4] desc IWDT                                                          */
      __IOM uint32_t WWDT       : 1;            /*!< [5..5] desc WWDT                                                          */
      __IOM uint32_t RSTB       : 1;            /*!< [6..6] desc RSTB                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t LOCKUP     : 1;            /*!< [8..8] desc LOCKUP                                                        */
      __IOM uint32_t SYSRESETREQ : 1;           /*!< [9..9] desc SYSRESETREQ                                                   */
    } RESETFLAG_f;
  } ;
  
  union {
    __IOM uint32_t GTIM1CAP;                    /*!< (@ 0x00000050) desc GTIM1CAP                                              */
    
    struct {
      __IOM uint32_t CH1        : 3;            /*!< [2..0] desc CH1                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t CH2        : 3;            /*!< [6..4] desc CH2                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t CH3        : 3;            /*!< [10..8] desc CH3                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t CH4        : 3;            /*!< [14..12] desc CH4                                                         */
    } GTIM1CAP_f;
  } ;
  
  union {
    __IOM uint32_t GTIM2CAP;                    /*!< (@ 0x00000054) desc GTIM2CAP                                              */
    
    struct {
      __IOM uint32_t CH1        : 3;            /*!< [2..0] desc CH1                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t CH2        : 3;            /*!< [6..4] desc CH2                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t CH3        : 3;            /*!< [10..8] desc CH3                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t CH4        : 3;            /*!< [14..12] desc CH4                                                         */
    } GTIM2CAP_f;
  } ;
  
  union {
    __IOM uint32_t GTIM3CAP;                    /*!< (@ 0x00000058) desc GTIM3CAP                                              */
    
    struct {
      __IOM uint32_t CH1        : 3;            /*!< [2..0] desc CH1                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t CH2        : 3;            /*!< [6..4] desc CH2                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t CH3        : 3;            /*!< [10..8] desc CH3                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t CH4        : 3;            /*!< [14..12] desc CH4                                                         */
    } GTIM3CAP_f;
  } ;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t ATIMETR;                     /*!< (@ 0x00000060) desc ATIMETR                                               */
    
    struct {
      __IOM uint32_t ATIMETR    : 3;            /*!< [2..0] desc ATIMETR                                                       */
    } ATIMETR_f;
  } ;
  
  union {
    __IOM uint32_t GTIMETR;                     /*!< (@ 0x00000064) desc GTIMETR                                               */
    
    struct {
      __IOM uint32_t GTIM1ETR   : 3;            /*!< [2..0] desc GTIM1ETR                                                      */
      __IM  uint32_t            : 1;
      __IOM uint32_t GTIM2ETR   : 3;            /*!< [6..4] desc GTIM2ETR                                                      */
      __IM  uint32_t            : 1;
      __IOM uint32_t GTIM3ETR   : 3;            /*!< [10..8] desc GTIM3ETR                                                     */
    } GTIMETR_f;
  } ;
  
  union {
    __IOM uint32_t ATIMGATE;                    /*!< (@ 0x00000068) desc ATIMGATE                                              */
    
