CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052.h
    struct {
      __IOM uint32_t ATIMGATE   : 3;            /*!< [2..0] desc ATIMGATE                                                      */
    } ATIMGATE_f;
  } ;
  
  union {
    __IOM uint32_t TIMITR;                      /*!< (@ 0x0000006C) desc TIMITR                                                */
    
    struct {
      __IOM uint32_t ATIMITR    : 3;            /*!< [2..0] desc ATIMITR                                                       */
      __IOM uint32_t GTIM1ITR   : 3;            /*!< [5..3] desc GTIM1ITR                                                      */
      __IOM uint32_t GTIM2ITR   : 3;            /*!< [8..6] desc GTIM2ITR                                                      */
      __IOM uint32_t GTIM3ITR   : 3;            /*!< [11..9] desc GTIM3ITR                                                     */
      __IM  uint32_t            : 3;
      __IOM uint32_t BTIM1ITR   : 3;            /*!< [17..15] desc BTIM1ITR                                                    */
      __IOM uint32_t BTIM2ITR   : 3;            /*!< [20..18] desc BTIM2ITR                                                    */
      __IOM uint32_t BTIM3ITR   : 3;            /*!< [23..21] desc BTIM3ITR                                                    */
    } TIMITR_f;
  } ;
  
  union {
    __IOM uint32_t MCO;                         /*!< (@ 0x00000070) desc MCO                                                   */
    
    struct {
      __IOM uint32_t SOURCE     : 4;            /*!< [3..0] desc SOURCE                                                        */
      __IOM uint32_t DIV        : 3;            /*!< [6..4] desc DIV                                                           */
    } MCO_f;
  } ;
  
  union {
    __IOM uint32_t IRMOD;                       /*!< (@ 0x00000074) desc IRMOD                                                 */
    
    struct {
      __IOM uint32_t MOD        : 4;            /*!< [3..0] desc MOD                                                           */
    } IRMOD_f;
  } ;
} SYSCTRL_TypeDef;                                 /*!< Size = 120 (0x78)                                                         */



/* =========================================================================================================================== */
/* ================                                           UART1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief desc UART1 (UART1)
  */

typedef struct {                                /*!< (@ 0x40013800) UART1 Structure                                            */
  
  union {
    __IOM uint32_t CR1;                         /*!< (@ 0x00000000) desc CR1                                                   */
    
    struct {
      __IOM uint32_t TXEN       : 1;            /*!< [0..0] desc TXEN                                                          */
      __IOM uint32_t RXEN       : 1;            /*!< [1..1] desc RXEN                                                          */
      __IOM uint32_t PARITY     : 2;            /*!< [3..2] desc PARITY                                                        */
      __IOM uint32_t STOP       : 2;            /*!< [5..4] desc STOP                                                          */
      __IOM uint32_t SYNC       : 1;            /*!< [6..6] desc SYNC                                                          */
      __IOM uint32_t LINEN      : 1;            /*!< [7..7] desc LINEN                                                         */
      __IOM uint32_t START      : 1;            /*!< [8..8] desc START                                                         */
      __IOM uint32_t OVER       : 2;            /*!< [10..9] desc OVER                                                         */
      __IOM uint32_t TXBRK      : 1;            /*!< [11..11] desc TXBRK                                                       */
      __IOM uint32_t BRKLEN     : 1;            /*!< [12..12] desc BRKLEN                                                      */
    } CR1_f;
  } ;
  
  union {
    __IOM uint32_t CR2;                         /*!< (@ 0x00000004) desc CR2                                                   */
    
    struct {
      __IOM uint32_t ADDREN     : 1;            /*!< [0..0] desc ADDREN                                                        */
      __IOM uint32_t SIGNAL     : 1;            /*!< [1..1] desc SIGNAL                                                        */
      __IOM uint32_t CTSEN      : 1;            /*!< [2..2] desc CTSEN                                                         */
      __IOM uint32_t RTSEN      : 1;            /*!< [3..3] desc RTSEN                                                         */
      __IOM uint32_t RXINV      : 1;            /*!< [4..4] desc RXINV                                                         */
      __IOM uint32_t TXINV      : 1;            /*!< [5..5] desc TXINV                                                         */
      __IOM uint32_t DMARX      : 1;            /*!< [6..6] desc DMARX                                                         */
      __IOM uint32_t DMATX      : 1;            /*!< [7..7] desc DMATX                                                         */
      __IOM uint32_t SOURCE      : 2;            /*!< [9..8] desc SORCE                                                         */
      __IOM uint32_t TIMCR      : 3;            /*!< [12..10] desc TIMCR                                                       */
    } CR2_f;
  } ;
  
  union {
    __IOM uint32_t IER;                         /*!< (@ 0x00000008) desc IER                                                   */
    
    struct {
      __IOM uint32_t TXE        : 1;            /*!< [0..0] desc TXE                                                           */
      __IOM uint32_t TC         : 1;            /*!< [1..1] desc TC                                                            */
      __IOM uint32_t RC         : 1;            /*!< [2..2] desc RC                                                            */
      __IOM uint32_t FE         : 1;            /*!< [3..3] desc FE                                                            */
      __IOM uint32_t PE         : 1;            /*!< [4..4] desc PE                                                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t CTS        : 1;            /*!< [6..6] desc CTS                                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t TIMOV      : 1;            /*!< [9..9] desc TIMOV                                                         */
      __IOM uint32_t BAUD       : 1;            /*!< [10..10] desc BAUD                                                        */
      __IOM uint32_t RXBRK      : 1;            /*!< [11..11] desc RXBRK                                                       */
    } IER_f;
  } ;
  
  union {
    __IOM uint32_t BRRI;                        /*!< (@ 0x0000000C) desc BRRI                                                  */
    
