CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052.h
    struct {
      __IOM uint32_t BRRI       : 16;           /*!< [15..0] desc BRRI                                                         */
    } BRRI_f;
  } ;
  
  union {
    __IOM uint32_t BRRF;                        /*!< (@ 0x00000010) desc BRRF                                                  */
    
    struct {
      __IOM uint32_t BRRF       : 4;            /*!< [3..0] desc BRRF                                                          */
    } BRRF_f;
  } ;
  
  union {
    __IOM uint32_t TIMARR;                      /*!< (@ 0x00000014) desc TIMARR                                                */
    
    struct {
      __IOM uint32_t TIMARR     : 24;           /*!< [23..0] desc TIMARR                                                       */
    } TIMARR_f;
  } ;
  
  union {
    __IM  uint32_t TIMCNT;                      /*!< (@ 0x00000018) desc TIMCNT                                                */
    
    struct {
      __IM  uint32_t TIMCNT     : 24;           /*!< [23..0] desc TIMCNT                                                       */
    } TIMCNT_f;
  } ;
  
  union {
    __IM  uint32_t ISR;                         /*!< (@ 0x0000001C) desc ISR                                                   */
    
    struct {
      __IM  uint32_t TXE        : 1;            /*!< [0..0] desc TXE                                                           */
      __IM  uint32_t TC         : 1;            /*!< [1..1] desc TC                                                            */
      __IM  uint32_t RC         : 1;            /*!< [2..2] desc RC                                                            */
      __IM  uint32_t FE         : 1;            /*!< [3..3] desc FE                                                            */
      __IM  uint32_t PE         : 1;            /*!< [4..4] desc PE                                                            */
      __IM  uint32_t MATCH      : 1;            /*!< [5..5] desc MATCH                                                         */
      __IM  uint32_t CTS        : 1;            /*!< [6..6] desc CTS                                                           */
      __IM  uint32_t CTSLV      : 1;            /*!< [7..7] desc CTSLV                                                         */
      __IM  uint32_t TXBUSY     : 1;            /*!< [8..8] desc TXBUSY                                                        */
      __IM  uint32_t TIMOV      : 1;            /*!< [9..9] desc TIMOV                                                         */
      __IM  uint32_t BAUD       : 1;            /*!< [10..10] desc BAUD                                                        */
      __IM  uint32_t RXBRK      : 1;            /*!< [11..11] desc RXBRK                                                       */
    } ISR_f;
  } ;
  
  union {
    __IOM uint32_t ICR;                         /*!< (@ 0x00000020) desc ICR                                                   */
    
    struct {
      __IOM uint32_t RFU        : 1;            /*!< [0..0] desc RFU                                                           */
      __IOM uint32_t TC         : 1;            /*!< [1..1] desc TC                                                            */
      __IOM uint32_t RC         : 1;            /*!< [2..2] desc RC                                                            */
      __IOM uint32_t FE         : 1;            /*!< [3..3] desc FE                                                            */
      __IOM uint32_t PE         : 1;            /*!< [4..4] desc PE                                                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t CTS        : 1;            /*!< [6..6] desc CTS                                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t TIMOV      : 1;            /*!< [9..9] desc TIMOV                                                         */
      __IOM uint32_t BAUD       : 1;            /*!< [10..10] desc BAUD                                                        */
      __IOM uint32_t RXBRK      : 1;            /*!< [11..11] desc RXBRK                                                       */
    } ICR_f;
  } ;
  
  union {
    __IM  uint32_t RDR;                         /*!< (@ 0x00000024) desc RDR                                                   */
    
    struct {
      __IM  uint32_t RDR        : 9;            /*!< [8..0] desc RDR                                                           */
    } RDR_f;
  } ;
  
  union {
    __OM  uint32_t TDR;                         /*!< (@ 0x00000028) desc TDR                                                   */
    
    struct {
      __OM  uint32_t TDR        : 9;            /*!< [8..0] desc TDR                                                           */
    } TDR_f;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t ADDR;                        /*!< (@ 0x00000030) desc ADDR                                                  */
    
    struct {
      __IOM uint32_t ADDR       : 8;            /*!< [7..0] desc ADDR                                                          */
    } ADDR_f;
  } ;
  
  union {
    __IOM uint32_t MASK;                        /*!< (@ 0x00000034) desc MASK                                                  */
    
    struct {
      __IOM uint32_t MASK       : 8;            /*!< [7..0] desc MASK                                                          */
    } MASK_f;
  } ;
} UART_TypeDef;                                    /*!< Size = 56 (0x38)                                                          */



/* =========================================================================================================================== */
/* ================                                            VC1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc VC1 (VC1)
  */

typedef struct {                                /*!< (@ 0x40012A00) VC1 Structure                                              */
  
  union {
    __IOM uint32_t DIV;                         /*!< (@ 0x00000000) desc DIV                                                   */
    
