CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052.h
#define ADC_SQR1_SQR4_Msk                 (0xfUL)                   /*!< SQR4 (Bitfield-Mask: 0x0f)                            */
/* =========================================================  ALTR  ========================================================== */
#define ADC_ALTR_REPEAT_Pos               (16UL)                    /*!< REPEAT (Bit 16)                                       */
#define ADC_ALTR_REPEAT_Msk               (0x10000UL)               /*!< REPEAT (Bitfield-Mask: 0x01)                          */
#define ADC_ALTR_CH15_Pos                 (15UL)                    /*!< CH15 (Bit 15)                                         */
#define ADC_ALTR_CH15_Msk                 (0x8000UL)                /*!< CH15 (Bitfield-Mask: 0x01)                            */
#define ADC_ALTR_CH14_Pos                 (14UL)                    /*!< CH14 (Bit 14)                                         */
#define ADC_ALTR_CH14_Msk                 (0x4000UL)                /*!< CH14 (Bitfield-Mask: 0x01)                            */
#define ADC_ALTR_CH13_Pos                 (13UL)                    /*!< CH13 (Bit 13)                                         */
#define ADC_ALTR_CH13_Msk                 (0x2000UL)                /*!< CH13 (Bitfield-Mask: 0x01)                            */
#define ADC_ALTR_CH12_Pos                 (12UL)                    /*!< CH12 (Bit 12)                                         */
#define ADC_ALTR_CH12_Msk                 (0x1000UL)                /*!< CH12 (Bitfield-Mask: 0x01)                            */
#define ADC_ALTR_CH11_Pos                 (11UL)                    /*!< CH11 (Bit 11)                                         */
#define ADC_ALTR_CH11_Msk                 (0x800UL)                 /*!< CH11 (Bitfield-Mask: 0x01)                            */
#define ADC_ALTR_CH10_Pos                 (10UL)                    /*!< CH10 (Bit 10)                                         */
#define ADC_ALTR_CH10_Msk                 (0x400UL)                 /*!< CH10 (Bitfield-Mask: 0x01)                            */
#define ADC_ALTR_CH9_Pos                  (9UL)                     /*!< CH9 (Bit 9)                                           */
#define ADC_ALTR_CH9_Msk                  (0x200UL)                 /*!< CH9 (Bitfield-Mask: 0x01)                             */
#define ADC_ALTR_CH8_Pos                  (8UL)                     /*!< CH8 (Bit 8)                                           */
#define ADC_ALTR_CH8_Msk                  (0x100UL)                 /*!< CH8 (Bitfield-Mask: 0x01)                             */
#define ADC_ALTR_CH7_Pos                  (7UL)                     /*!< CH7 (Bit 7)                                           */
#define ADC_ALTR_CH7_Msk                  (0x80UL)                  /*!< CH7 (Bitfield-Mask: 0x01)                             */
#define ADC_ALTR_CH6_Pos                  (6UL)                     /*!< CH6 (Bit 6)                                           */
#define ADC_ALTR_CH6_Msk                  (0x40UL)                  /*!< CH6 (Bitfield-Mask: 0x01)                             */
#define ADC_ALTR_CH5_Pos                  (5UL)                     /*!< CH5 (Bit 5)                                           */
#define ADC_ALTR_CH5_Msk                  (0x20UL)                  /*!< CH5 (Bitfield-Mask: 0x01)                             */
#define ADC_ALTR_CH4_Pos                  (4UL)                     /*!< CH4 (Bit 4)                                           */
#define ADC_ALTR_CH4_Msk                  (0x10UL)                  /*!< CH4 (Bitfield-Mask: 0x01)                             */
#define ADC_ALTR_CH3_Pos                  (3UL)                     /*!< CH3 (Bit 3)                                           */
#define ADC_ALTR_CH3_Msk                  (0x8UL)                   /*!< CH3 (Bitfield-Mask: 0x01)                             */
#define ADC_ALTR_CH2_Pos                  (2UL)                     /*!< CH2 (Bit 2)                                           */
#define ADC_ALTR_CH2_Msk                  (0x4UL)                   /*!< CH2 (Bitfield-Mask: 0x01)                             */
#define ADC_ALTR_CH1_Pos                  (1UL)                     /*!< CH1 (Bit 1)                                           */
#define ADC_ALTR_CH1_Msk                  (0x2UL)                   /*!< CH1 (Bitfield-Mask: 0x01)                             */
#define ADC_ALTR_CH0_Pos                  (0UL)                     /*!< CH0 (Bit 0)                                           */
#define ADC_ALTR_CH0_Msk                  (0x1UL)                   /*!< CH0 (Bitfield-Mask: 0x01)                             */
/* ========================================================  RESULT  ========================================================= */
#define ADC_RESULT_RESULT_Pos             (0UL)                     /*!< RESULT (Bit 0)                                        */
#define ADC_RESULT_RESULT_Msk             (0xffffUL)                /*!< RESULT (Bitfield-Mask: 0xffff)                        */


/* =========================================================================================================================== */
/* ================                                           ATIM                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  ARR  ========================================================== */
#define ATIM_ARR_ARR_Pos                  (0UL)                     /*!< ARR (Bit 0)                                           */
#define ATIM_ARR_ARR_Msk                  (0xffffUL)                /*!< ARR (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  CNT  ========================================================== */
#define ATIM_CNT_CNT_Pos                  (0UL)                     /*!< CNT (Bit 0)                                           */
#define ATIM_CNT_CNT_Msk                  (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  CR  =========================================================== */
#define ATIM_CR_UNDE_Pos                  (29UL)                    /*!< UNDE (Bit 29)                                         */
#define ATIM_CR_UNDE_Msk                  (0x20000000UL)            /*!< UNDE (Bitfield-Mask: 0x01)                            */
#define ATIM_CR_OVE_Pos                   (28UL)                    /*!< OVE (Bit 28)                                          */
#define ATIM_CR_OVE_Msk                   (0x10000000UL)            /*!< OVE (Bitfield-Mask: 0x01)                             */
#define ATIM_CR_DIR_Pos                   (27UL)                    /*!< DIR (Bit 27)                                          */
#define ATIM_CR_DIR_Msk                   (0x8000000UL)             /*!< DIR (Bitfield-Mask: 0x01)                             */
#define ATIM_CR_BG_Pos                    (26UL)                    /*!< BG (Bit 26)                                           */
#define ATIM_CR_BG_Msk                    (0x4000000UL)             /*!< BG (Bitfield-Mask: 0x01)                              */
#define ATIM_CR_UG_Pos                    (25UL)                    /*!< UG (Bit 25)                                           */
#define ATIM_CR_UG_Msk                    (0x2000000UL)             /*!< UG (Bitfield-Mask: 0x01)                              */
#define ATIM_CR_TG_Pos                    (24UL)                    /*!< TG (Bit 24)                                           */
#define ATIM_CR_TG_Msk                    (0x1000000UL)             /*!< TG (Bitfield-Mask: 0x01)                              */
#define ATIM_CR_OCCE_Pos                  (23UL)                    /*!< OCCE (Bit 23)                                         */
#define ATIM_CR_OCCE_Msk                  (0x800000UL)              /*!< OCCE (Bitfield-Mask: 0x01)                            */
#define ATIM_CR_CISA_Pos                  (21UL)                    /*!< CISA (Bit 21)                                         */
#define ATIM_CR_CISA_Msk                  (0x600000UL)              /*!< CISA (Bitfield-Mask: 0x03)                            */
#define ATIM_CR_BIE_Pos                   (20UL)                    /*!< BIE (Bit 20)                                          */
#define ATIM_CR_BIE_Msk                   (0x100000UL)              /*!< BIE (Bitfield-Mask: 0x01)                             */
#define ATIM_CR_TIE_Pos                   (19UL)                    /*!< TIE (Bit 19)                                          */
#define ATIM_CR_TIE_Msk                   (0x80000UL)               /*!< TIE (Bitfield-Mask: 0x01)                             */
#define ATIM_CR_URS_Pos                   (17UL)                    /*!< URS (Bit 17)                                          */
#define ATIM_CR_URS_Msk                   (0x20000UL)               /*!< URS (Bitfield-Mask: 0x01)                             */
#define ATIM_CR_OCCS_Pos                  (16UL)                    /*!< OCCS (Bit 16)                                         */
#define ATIM_CR_OCCS_Msk                  (0x10000UL)               /*!< OCCS (Bitfield-Mask: 0x01)                            */
#define ATIM_CR_ONESHOT_Pos               (14UL)                    /*!< ONESHOT (Bit 14)                                      */
#define ATIM_CR_ONESHOT_Msk               (0x4000UL)                /*!< ONESHOT (Bitfield-Mask: 0x01)                         */
#define ATIM_CR_MODE_Pos                  (12UL)                    /*!< MODE (Bit 12)                                         */
#define ATIM_CR_MODE_Msk                  (0x3000UL)                /*!< MODE (Bitfield-Mask: 0x03)                            */
#define ATIM_CR_UIE_Pos                   (10UL)                    /*!< UIE (Bit 10)                                          */
#define ATIM_CR_UIE_Msk                   (0x400UL)                 /*!< UIE (Bitfield-Mask: 0x01)                             */
#define ATIM_CR_BUFPEN_Pos                (7UL)                     /*!< BUFPEN (Bit 7)                                        */
#define ATIM_CR_BUFPEN_Msk                (0x80UL)                  /*!< BUFPEN (Bitfield-Mask: 0x01)                          */
#define ATIM_CR_PRS_Pos                   (4UL)                     /*!< PRS (Bit 4)                                           */
#define ATIM_CR_PRS_Msk                   (0x70UL)                  /*!< PRS (Bitfield-Mask: 0x07)                             */
#define ATIM_CR_PWM2S_Pos                 (3UL)                     /*!< PWM2S (Bit 3)                                         */
#define ATIM_CR_PWM2S_Msk                 (0x8UL)                   /*!< PWM2S (Bitfield-Mask: 0x01)                           */
#define ATIM_CR_CT_Pos                    (2UL)                     /*!< CT (Bit 2)                                            */
#define ATIM_CR_CT_Msk                    (0x4UL)                   /*!< CT (Bitfield-Mask: 0x01)                              */
#define ATIM_CR_COMP_Pos                  (1UL)                     /*!< COMP (Bit 1)                                          */
#define ATIM_CR_COMP_Msk                  (0x2UL)                   /*!< COMP (Bitfield-Mask: 0x01)                            */
#define ATIM_CR_EN_Pos                    (0UL)                     /*!< EN (Bit 0)                                            */
#define ATIM_CR_EN_Msk                    (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ==========================================================  ISR  ========================================================== */
#define ATIM_ISR_C4AF_Pos                 (18UL)                    /*!< C4AF (Bit 18)                                         */
#define ATIM_ISR_C4AF_Msk                 (0x40000UL)               /*!< C4AF (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_UNDF_Pos                 (17UL)                    /*!< UNDF (Bit 17)                                         */
#define ATIM_ISR_UNDF_Msk                 (0x20000UL)               /*!< UNDF (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_OVF_Pos                  (16UL)                    /*!< OVF (Bit 16)                                          */
#define ATIM_ISR_OVF_Msk                  (0x10000UL)               /*!< OVF (Bitfield-Mask: 0x01)                             */
#define ATIM_ISR_TIF_Pos                  (15UL)                    /*!< TIF (Bit 15)                                          */
#define ATIM_ISR_TIF_Msk                  (0x8000UL)                /*!< TIF (Bitfield-Mask: 0x01)                             */
#define ATIM_ISR_BIF_Pos                  (14UL)                    /*!< BIF (Bit 14)                                          */
#define ATIM_ISR_BIF_Msk                  (0x4000UL)                /*!< BIF (Bitfield-Mask: 0x01)                             */
#define ATIM_ISR_C3BE_Pos                 (13UL)                    /*!< C3BE (Bit 13)                                         */
#define ATIM_ISR_C3BE_Msk                 (0x2000UL)                /*!< C3BE (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_C2BE_Pos                 (12UL)                    /*!< C2BE (Bit 12)                                         */
#define ATIM_ISR_C2BE_Msk                 (0x1000UL)                /*!< C2BE (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_C1BE_Pos                 (11UL)                    /*!< C1BE (Bit 11)                                         */
#define ATIM_ISR_C1BE_Msk                 (0x800UL)                 /*!< C1BE (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_C3AE_Pos                 (10UL)                    /*!< C3AE (Bit 10)                                         */
#define ATIM_ISR_C3AE_Msk                 (0x400UL)                 /*!< C3AE (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_C2AE_Pos                 (9UL)                     /*!< C2AE (Bit 9)                                          */
#define ATIM_ISR_C2AE_Msk                 (0x200UL)                 /*!< C2AE (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_C1AE_Pos                 (8UL)                     /*!< C1AE (Bit 8)                                          */
#define ATIM_ISR_C1AE_Msk                 (0x100UL)                 /*!< C1AE (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_C3BF_Pos                 (7UL)                     /*!< C3BF (Bit 7)                                          */
#define ATIM_ISR_C3BF_Msk                 (0x80UL)                  /*!< C3BF (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_C2BF_Pos                 (6UL)                     /*!< C2BF (Bit 6)                                          */
#define ATIM_ISR_C2BF_Msk                 (0x40UL)                  /*!< C2BF (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_C1BF_Pos                 (5UL)                     /*!< C1BF (Bit 5)                                          */
#define ATIM_ISR_C1BF_Msk                 (0x20UL)                  /*!< C1BF (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_C3AF_Pos                 (4UL)                     /*!< C3AF (Bit 4)                                          */
#define ATIM_ISR_C3AF_Msk                 (0x10UL)                  /*!< C3AF (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_C2AF_Pos                 (3UL)                     /*!< C2AF (Bit 3)                                          */
#define ATIM_ISR_C2AF_Msk                 (0x8UL)                   /*!< C2AF (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_C1AF_Pos                 (2UL)                     /*!< C1AF (Bit 2)                                          */
#define ATIM_ISR_C1AF_Msk                 (0x4UL)                   /*!< C1AF (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_UIF_Pos                  (0UL)                     /*!< UIF (Bit 0)                                           */
#define ATIM_ISR_UIF_Msk                  (0x1UL)                   /*!< UIF (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ICR  ========================================================== */
#define ATIM_ICR_C4AF_Pos                 (18UL)                    /*!< C4AF (Bit 18)                                         */
#define ATIM_ICR_C4AF_Msk                 (0x40000UL)               /*!< C4AF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_UNDF_Pos                 (17UL)                    /*!< UNDF (Bit 17)                                         */
#define ATIM_ICR_UNDF_Msk                 (0x20000UL)               /*!< UNDF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_OVF_Pos                  (16UL)                    /*!< OVF (Bit 16)                                          */
#define ATIM_ICR_OVF_Msk                  (0x10000UL)               /*!< OVF (Bitfield-Mask: 0x01)                             */
#define ATIM_ICR_TIF_Pos                  (15UL)                    /*!< TIF (Bit 15)                                          */
#define ATIM_ICR_TIF_Msk                  (0x8000UL)                /*!< TIF (Bitfield-Mask: 0x01)                             */
#define ATIM_ICR_BIF_Pos                  (14UL)                    /*!< BIF (Bit 14)                                          */
#define ATIM_ICR_BIF_Msk                  (0x4000UL)                /*!< BIF (Bitfield-Mask: 0x01)                             */
#define ATIM_ICR_C3BE_Pos                 (13UL)                    /*!< C3BE (Bit 13)                                         */
#define ATIM_ICR_C3BE_Msk                 (0x2000UL)                /*!< C3BE (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_C2BE_Pos                 (12UL)                    /*!< C2BE (Bit 12)                                         */
#define ATIM_ICR_C2BE_Msk                 (0x1000UL)                /*!< C2BE (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_C1BE_Pos                 (11UL)                    /*!< C1BE (Bit 11)                                         */
#define ATIM_ICR_C1BE_Msk                 (0x800UL)                 /*!< C1BE (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_C3AE_Pos                 (10UL)                    /*!< C3AE (Bit 10)                                         */
#define ATIM_ICR_C3AE_Msk                 (0x400UL)                 /*!< C3AE (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_C2AE_Pos                 (9UL)                     /*!< C2AE (Bit 9)                                          */
#define ATIM_ICR_C2AE_Msk                 (0x200UL)                 /*!< C2AE (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_C1AE_Pos                 (8UL)                     /*!< C1AE (Bit 8)                                          */
#define ATIM_ICR_C1AE_Msk                 (0x100UL)                 /*!< C1AE (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_C3BF_Pos                 (7UL)                     /*!< C3BF (Bit 7)                                          */
#define ATIM_ICR_C3BF_Msk                 (0x80UL)                  /*!< C3BF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_C2BF_Pos                 (6UL)                     /*!< C2BF (Bit 6)                                          */
#define ATIM_ICR_C2BF_Msk                 (0x40UL)                  /*!< C2BF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_C1BF_Pos                 (5UL)                     /*!< C1BF (Bit 5)                                          */
#define ATIM_ICR_C1BF_Msk                 (0x20UL)                  /*!< C1BF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_C3AF_Pos                 (4UL)                     /*!< C3AF (Bit 4)                                          */
#define ATIM_ICR_C3AF_Msk                 (0x10UL)                  /*!< C3AF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_C2AF_Pos                 (3UL)                     /*!< C2AF (Bit 3)                                          */
#define ATIM_ICR_C2AF_Msk                 (0x8UL)                   /*!< C2AF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_C1AF_Pos                 (2UL)                     /*!< C1AF (Bit 2)                                          */
#define ATIM_ICR_C1AF_Msk                 (0x4UL)                   /*!< C1AF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_UIF_Pos                  (0UL)                     /*!< UIF (Bit 0)                                           */
#define ATIM_ICR_UIF_Msk                  (0x1UL)                   /*!< UIF (Bitfield-Mask: 0x01)                             */
/* =========================================================  MSCR  ========================================================== */
#define ATIM_MSCR_IB1S_Pos                (12UL)                    /*!< IB1S (Bit 12)                                         */
#define ATIM_MSCR_IB1S_Msk                (0x1000UL)                /*!< IB1S (Bitfield-Mask: 0x01)                            */
#define ATIM_MSCR_IA1S_Pos                (11UL)                    /*!< IA1S (Bit 11)                                         */
#define ATIM_MSCR_IA1S_Msk                (0x800UL)                 /*!< IA1S (Bitfield-Mask: 0x01)                            */
#define ATIM_MSCR_SMS_Pos                 (8UL)                     /*!< SMS (Bit 8)                                           */
#define ATIM_MSCR_SMS_Msk                 (0x700UL)                 /*!< SMS (Bitfield-Mask: 0x07)                             */
#define ATIM_MSCR_TS_Pos                  (5UL)                     /*!< TS (Bit 5)                                            */
#define ATIM_MSCR_TS_Msk                  (0xe0UL)                  /*!< TS (Bitfield-Mask: 0x07)                              */
#define ATIM_MSCR_MSM_Pos                 (4UL)                     /*!< MSM (Bit 4)                                           */
#define ATIM_MSCR_MSM_Msk                 (0x10UL)                  /*!< MSM (Bitfield-Mask: 0x01)                             */
#define ATIM_MSCR_CCDS_Pos                (3UL)                     /*!< CCDS (Bit 3)                                          */
#define ATIM_MSCR_CCDS_Msk                (0x8UL)                   /*!< CCDS (Bitfield-Mask: 0x01)                            */
#define ATIM_MSCR_MMS_Pos                 (0UL)                     /*!< MMS (Bit 0)                                           */
#define ATIM_MSCR_MMS_Msk                 (0x7UL)                   /*!< MMS (Bitfield-Mask: 0x07)                             */
/* =========================================================  FLTR  ========================================================== */
#define ATIM_FLTR_ETP_Pos                 (31UL)                    /*!< ETP (Bit 31)                                          */
#define ATIM_FLTR_ETP_Msk                 (0x80000000UL)            /*!< ETP (Bitfield-Mask: 0x01)                             */
#define ATIM_FLTR_FLTET_Pos               (28UL)                    /*!< FLTET (Bit 28)                                        */
