CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052.h
#define ATIM_FLTR_FLTET_Msk               (0x70000000UL)            /*!< FLTET (Bitfield-Mask: 0x07)                           */
#define ATIM_FLTR_BKP_Pos                 (27UL)                    /*!< BKP (Bit 27)                                          */
#define ATIM_FLTR_BKP_Msk                 (0x8000000UL)             /*!< BKP (Bitfield-Mask: 0x01)                             */
#define ATIM_FLTR_FLTBK_Pos               (24UL)                    /*!< FLTBK (Bit 24)                                        */
#define ATIM_FLTR_FLTBK_Msk               (0x7000000UL)             /*!< FLTBK (Bitfield-Mask: 0x07)                           */
#define ATIM_FLTR_CCP3B_Pos               (23UL)                    /*!< CCP3B (Bit 23)                                        */
#define ATIM_FLTR_CCP3B_Msk               (0x800000UL)              /*!< CCP3B (Bitfield-Mask: 0x01)                           */
#define ATIM_FLTR_OCM3BFLT3B_Pos          (20UL)                    /*!< OCM3BFLT3B (Bit 20)                                   */
#define ATIM_FLTR_OCM3BFLT3B_Msk          (0x700000UL)              /*!< OCM3BFLT3B (Bitfield-Mask: 0x07)                      */
#define ATIM_FLTR_CCP3A_Pos               (19UL)                    /*!< CCP3A (Bit 19)                                        */
#define ATIM_FLTR_CCP3A_Msk               (0x80000UL)               /*!< CCP3A (Bitfield-Mask: 0x01)                           */
#define ATIM_FLTR_OCM3AFLT3A_Pos          (16UL)                    /*!< OCM3AFLT3A (Bit 16)                                   */
#define ATIM_FLTR_OCM3AFLT3A_Msk          (0x70000UL)               /*!< OCM3AFLT3A (Bitfield-Mask: 0x07)                      */
#define ATIM_FLTR_CCP2B_Pos               (15UL)                    /*!< CCP2B (Bit 15)                                        */
#define ATIM_FLTR_CCP2B_Msk               (0x8000UL)                /*!< CCP2B (Bitfield-Mask: 0x01)                           */
#define ATIM_FLTR_OCM2BFLT2B_Pos          (12UL)                    /*!< OCM2BFLT2B (Bit 12)                                   */
#define ATIM_FLTR_OCM2BFLT2B_Msk          (0x7000UL)                /*!< OCM2BFLT2B (Bitfield-Mask: 0x07)                      */
#define ATIM_FLTR_CCP2A_Pos               (11UL)                    /*!< CCP2A (Bit 11)                                        */
#define ATIM_FLTR_CCP2A_Msk               (0x800UL)                 /*!< CCP2A (Bitfield-Mask: 0x01)                           */
#define ATIM_FLTR_OCM2AFLT2A_Pos          (8UL)                     /*!< OCM2AFLT2A (Bit 8)                                    */
#define ATIM_FLTR_OCM2AFLT2A_Msk          (0x700UL)                 /*!< OCM2AFLT2A (Bitfield-Mask: 0x07)                      */
#define ATIM_FLTR_CCP1B_Pos               (7UL)                     /*!< CCP1B (Bit 7)                                         */
#define ATIM_FLTR_CCP1B_Msk               (0x80UL)                  /*!< CCP1B (Bitfield-Mask: 0x01)                           */
#define ATIM_FLTR_OCM1BFLT1B_Pos          (4UL)                     /*!< OCM1BFLT1B (Bit 4)                                    */
#define ATIM_FLTR_OCM1BFLT1B_Msk          (0x70UL)                  /*!< OCM1BFLT1B (Bitfield-Mask: 0x07)                      */
#define ATIM_FLTR_CCP1A_Pos               (3UL)                     /*!< CCP1A (Bit 3)                                         */
#define ATIM_FLTR_CCP1A_Msk               (0x8UL)                   /*!< CCP1A (Bitfield-Mask: 0x01)                           */
#define ATIM_FLTR_OCM1AFLT1A_Pos          (0UL)                     /*!< OCM1AFLT1A (Bit 0)                                    */
#define ATIM_FLTR_OCM1AFLT1A_Msk          (0x7UL)                   /*!< OCM1AFLT1A (Bitfield-Mask: 0x07)                      */
/* =========================================================  TRIG  ========================================================== */
#define ATIM_TRIG_ADTE_Pos                (7UL)                     /*!< ADTE (Bit 7)                                          */
#define ATIM_TRIG_ADTE_Msk                (0x80UL)                  /*!< ADTE (Bitfield-Mask: 0x01)                            */
#define ATIM_TRIG_CM3BE_Pos               (6UL)                     /*!< CM3BE (Bit 6)                                         */
#define ATIM_TRIG_CM3BE_Msk               (0x40UL)                  /*!< CM3BE (Bitfield-Mask: 0x01)                           */
#define ATIM_TRIG_CM2BE_Pos               (5UL)                     /*!< CM2BE (Bit 5)                                         */
#define ATIM_TRIG_CM2BE_Msk               (0x20UL)                  /*!< CM2BE (Bitfield-Mask: 0x01)                           */
#define ATIM_TRIG_CM1BE_Pos               (4UL)                     /*!< CM1BE (Bit 4)                                         */
#define ATIM_TRIG_CM1BE_Msk               (0x10UL)                  /*!< CM1BE (Bitfield-Mask: 0x01)                           */
#define ATIM_TRIG_CM3AE_Pos               (3UL)                     /*!< CM3AE (Bit 3)                                         */
#define ATIM_TRIG_CM3AE_Msk               (0x8UL)                   /*!< CM3AE (Bitfield-Mask: 0x01)                           */
#define ATIM_TRIG_CM2AE_Pos               (2UL)                     /*!< CM2AE (Bit 2)                                         */
#define ATIM_TRIG_CM2AE_Msk               (0x4UL)                   /*!< CM2AE (Bitfield-Mask: 0x01)                           */
#define ATIM_TRIG_CM1AE_Pos               (1UL)                     /*!< CM1AE (Bit 1)                                         */
#define ATIM_TRIG_CM1AE_Msk               (0x2UL)                   /*!< CM1AE (Bitfield-Mask: 0x01)                           */
#define ATIM_TRIG_UEVE_Pos                (0UL)                     /*!< UEVE (Bit 0)                                          */
#define ATIM_TRIG_UEVE_Msk                (0x1UL)                   /*!< UEVE (Bitfield-Mask: 0x01)                            */
/* =========================================================  CH1CR  ========================================================= */
#define ATIM_CH1CR_CCGB_Pos               (15UL)                    /*!< CCGB (Bit 15)                                         */
#define ATIM_CH1CR_CCGB_Msk               (0x8000UL)                /*!< CCGB (Bitfield-Mask: 0x01)                            */
#define ATIM_CH1CR_CCGA_Pos               (14UL)                    /*!< CCGA (Bit 14)                                         */
#define ATIM_CH1CR_CCGA_Msk               (0x4000UL)                /*!< CCGA (Bitfield-Mask: 0x01)                            */
#define ATIM_CH1CR_CISB_Pos               (12UL)                    /*!< CISB (Bit 12)                                         */
#define ATIM_CH1CR_CISB_Msk               (0x3000UL)                /*!< CISB (Bitfield-Mask: 0x03)                            */
#define ATIM_CH1CR_CDEB_Pos               (11UL)                    /*!< CDEB (Bit 11)                                         */
#define ATIM_CH1CR_CDEB_Msk               (0x800UL)                 /*!< CDEB (Bitfield-Mask: 0x01)                            */
#define ATIM_CH1CR_CDEA_Pos               (10UL)                    /*!< CDEA (Bit 10)                                         */
#define ATIM_CH1CR_CDEA_Msk               (0x400UL)                 /*!< CDEA (Bitfield-Mask: 0x01)                            */
#define ATIM_CH1CR_CIEB_Pos               (9UL)                     /*!< CIEB (Bit 9)                                          */
#define ATIM_CH1CR_CIEB_Msk               (0x200UL)                 /*!< CIEB (Bitfield-Mask: 0x01)                            */
#define ATIM_CH1CR_CIEA_Pos               (8UL)                     /*!< CIEA (Bit 8)                                          */
#define ATIM_CH1CR_CIEA_Msk               (0x100UL)                 /*!< CIEA (Bitfield-Mask: 0x01)                            */
#define ATIM_CH1CR_BUFEB_Pos              (7UL)                     /*!< BUFEB (Bit 7)                                         */
#define ATIM_CH1CR_BUFEB_Msk              (0x80UL)                  /*!< BUFEB (Bitfield-Mask: 0x01)                           */
#define ATIM_CH1CR_BUFEA_Pos              (6UL)                     /*!< BUFEA (Bit 6)                                         */
#define ATIM_CH1CR_BUFEA_Msk              (0x40UL)                  /*!< BUFEA (Bitfield-Mask: 0x01)                           */
#define ATIM_CH1CR_CSB_Pos                (5UL)                     /*!< CSB (Bit 5)                                           */
#define ATIM_CH1CR_CSB_Msk                (0x20UL)                  /*!< CSB (Bitfield-Mask: 0x01)                             */
#define ATIM_CH1CR_CSA_Pos                (4UL)                     /*!< CSA (Bit 4)                                           */
#define ATIM_CH1CR_CSA_Msk                (0x10UL)                  /*!< CSA (Bitfield-Mask: 0x01)                             */
#define ATIM_CH1CR_BKSB_Pos               (2UL)                     /*!< BKSB (Bit 2)                                          */
#define ATIM_CH1CR_BKSB_Msk               (0xcUL)                   /*!< BKSB (Bitfield-Mask: 0x03)                            */
#define ATIM_CH1CR_BKSA_Pos               (0UL)                     /*!< BKSA (Bit 0)                                          */
#define ATIM_CH1CR_BKSA_Msk               (0x3UL)                   /*!< BKSA (Bitfield-Mask: 0x03)                            */
/* =========================================================  CH2CR  ========================================================= */
#define ATIM_CH2CR_CCGB_Pos               (15UL)                    /*!< CCGB (Bit 15)                                         */
#define ATIM_CH2CR_CCGB_Msk               (0x8000UL)                /*!< CCGB (Bitfield-Mask: 0x01)                            */
#define ATIM_CH2CR_CCGA_Pos               (14UL)                    /*!< CCGA (Bit 14)                                         */
#define ATIM_CH2CR_CCGA_Msk               (0x4000UL)                /*!< CCGA (Bitfield-Mask: 0x01)                            */
#define ATIM_CH2CR_CISB_Pos               (12UL)                    /*!< CISB (Bit 12)                                         */
#define ATIM_CH2CR_CISB_Msk               (0x3000UL)                /*!< CISB (Bitfield-Mask: 0x03)                            */
#define ATIM_CH2CR_CDEB_Pos               (11UL)                    /*!< CDEB (Bit 11)                                         */
#define ATIM_CH2CR_CDEB_Msk               (0x800UL)                 /*!< CDEB (Bitfield-Mask: 0x01)                            */
#define ATIM_CH2CR_CDEA_Pos               (10UL)                    /*!< CDEA (Bit 10)                                         */
#define ATIM_CH2CR_CDEA_Msk               (0x400UL)                 /*!< CDEA (Bitfield-Mask: 0x01)                            */
#define ATIM_CH2CR_CIEB_Pos               (9UL)                     /*!< CIEB (Bit 9)                                          */
#define ATIM_CH2CR_CIEB_Msk               (0x200UL)                 /*!< CIEB (Bitfield-Mask: 0x01)                            */
#define ATIM_CH2CR_CIEA_Pos               (8UL)                     /*!< CIEA (Bit 8)                                          */
#define ATIM_CH2CR_CIEA_Msk               (0x100UL)                 /*!< CIEA (Bitfield-Mask: 0x01)                            */
#define ATIM_CH2CR_BUFEB_Pos              (7UL)                     /*!< BUFEB (Bit 7)                                         */
#define ATIM_CH2CR_BUFEB_Msk              (0x80UL)                  /*!< BUFEB (Bitfield-Mask: 0x01)                           */
#define ATIM_CH2CR_BUFEA_Pos              (6UL)                     /*!< BUFEA (Bit 6)                                         */
#define ATIM_CH2CR_BUFEA_Msk              (0x40UL)                  /*!< BUFEA (Bitfield-Mask: 0x01)                           */
#define ATIM_CH2CR_CSB_Pos                (5UL)                     /*!< CSB (Bit 5)                                           */
#define ATIM_CH2CR_CSB_Msk                (0x20UL)                  /*!< CSB (Bitfield-Mask: 0x01)                             */
#define ATIM_CH2CR_CSA_Pos                (4UL)                     /*!< CSA (Bit 4)                                           */
#define ATIM_CH2CR_CSA_Msk                (0x10UL)                  /*!< CSA (Bitfield-Mask: 0x01)                             */
#define ATIM_CH2CR_BKSB_Pos               (2UL)                     /*!< BKSB (Bit 2)                                          */
#define ATIM_CH2CR_BKSB_Msk               (0xcUL)                   /*!< BKSB (Bitfield-Mask: 0x03)                            */
#define ATIM_CH2CR_BKSA_Pos               (0UL)                     /*!< BKSA (Bit 0)                                          */
#define ATIM_CH2CR_BKSA_Msk               (0x3UL)                   /*!< BKSA (Bitfield-Mask: 0x03)                            */
/* =========================================================  CH3CR  ========================================================= */
#define ATIM_CH3CR_CCGB_Pos               (15UL)                    /*!< CCGB (Bit 15)                                         */
#define ATIM_CH3CR_CCGB_Msk               (0x8000UL)                /*!< CCGB (Bitfield-Mask: 0x01)                            */
#define ATIM_CH3CR_CCGA_Pos               (14UL)                    /*!< CCGA (Bit 14)                                         */
#define ATIM_CH3CR_CCGA_Msk               (0x4000UL)                /*!< CCGA (Bitfield-Mask: 0x01)                            */
#define ATIM_CH3CR_CISB_Pos               (12UL)                    /*!< CISB (Bit 12)                                         */
#define ATIM_CH3CR_CISB_Msk               (0x3000UL)                /*!< CISB (Bitfield-Mask: 0x03)                            */
#define ATIM_CH3CR_CDEB_Pos               (11UL)                    /*!< CDEB (Bit 11)                                         */
#define ATIM_CH3CR_CDEB_Msk               (0x800UL)                 /*!< CDEB (Bitfield-Mask: 0x01)                            */
#define ATIM_CH3CR_CDEA_Pos               (10UL)                    /*!< CDEA (Bit 10)                                         */
#define ATIM_CH3CR_CDEA_Msk               (0x400UL)                 /*!< CDEA (Bitfield-Mask: 0x01)                            */
#define ATIM_CH3CR_CIEB_Pos               (9UL)                     /*!< CIEB (Bit 9)                                          */
#define ATIM_CH3CR_CIEB_Msk               (0x200UL)                 /*!< CIEB (Bitfield-Mask: 0x01)                            */
#define ATIM_CH3CR_CIEA_Pos               (8UL)                     /*!< CIEA (Bit 8)                                          */
#define ATIM_CH3CR_CIEA_Msk               (0x100UL)                 /*!< CIEA (Bitfield-Mask: 0x01)                            */
#define ATIM_CH3CR_BUFEB_Pos              (7UL)                     /*!< BUFEB (Bit 7)                                         */
#define ATIM_CH3CR_BUFEB_Msk              (0x80UL)                  /*!< BUFEB (Bitfield-Mask: 0x01)                           */
#define ATIM_CH3CR_BUFEA_Pos              (6UL)                     /*!< BUFEA (Bit 6)                                         */
#define ATIM_CH3CR_BUFEA_Msk              (0x40UL)                  /*!< BUFEA (Bitfield-Mask: 0x01)                           */
#define ATIM_CH3CR_CSB_Pos                (5UL)                     /*!< CSB (Bit 5)                                           */
#define ATIM_CH3CR_CSB_Msk                (0x20UL)                  /*!< CSB (Bitfield-Mask: 0x01)                             */
#define ATIM_CH3CR_CSA_Pos                (4UL)                     /*!< CSA (Bit 4)                                           */
#define ATIM_CH3CR_CSA_Msk                (0x10UL)                  /*!< CSA (Bitfield-Mask: 0x01)                             */
#define ATIM_CH3CR_BKSB_Pos               (2UL)                     /*!< BKSB (Bit 2)                                          */
#define ATIM_CH3CR_BKSB_Msk               (0xcUL)                   /*!< BKSB (Bitfield-Mask: 0x03)                            */
#define ATIM_CH3CR_BKSA_Pos               (0UL)                     /*!< BKSA (Bit 0)                                          */
#define ATIM_CH3CR_BKSA_Msk               (0x3UL)                   /*!< BKSA (Bitfield-Mask: 0x03)                            */
/* ==========================================================  DTR  ========================================================== */
#define ATIM_DTR_VCE_Pos                  (14UL)                    /*!< VCE (Bit 14)                                          */
#define ATIM_DTR_VCE_Msk                  (0x4000UL)                /*!< VCE (Bitfield-Mask: 0x01)                             */
#define ATIM_DTR_SAFEEN_Pos               (13UL)                    /*!< SAFEEN (Bit 13)                                       */
#define ATIM_DTR_SAFEEN_Msk               (0x2000UL)                /*!< SAFEEN (Bitfield-Mask: 0x01)                          */
#define ATIM_DTR_MOE_Pos                  (12UL)                    /*!< MOE (Bit 12)                                          */
#define ATIM_DTR_MOE_Msk                  (0x1000UL)                /*!< MOE (Bitfield-Mask: 0x01)                             */
#define ATIM_DTR_AOE_Pos                  (11UL)                    /*!< AOE (Bit 11)                                          */
#define ATIM_DTR_AOE_Msk                  (0x800UL)                 /*!< AOE (Bitfield-Mask: 0x01)                             */
#define ATIM_DTR_BKE_Pos                  (10UL)                    /*!< BKE (Bit 10)                                          */
#define ATIM_DTR_BKE_Msk                  (0x400UL)                 /*!< BKE (Bitfield-Mask: 0x01)                             */
#define ATIM_DTR_DTEN_Pos                 (9UL)                     /*!< DTEN (Bit 9)                                          */
#define ATIM_DTR_DTEN_Msk                 (0x200UL)                 /*!< DTEN (Bitfield-Mask: 0x01)                            */
#define ATIM_DTR_DTR_Pos                  (0UL)                     /*!< DTR (Bit 0)                                           */
#define ATIM_DTR_DTR_Msk                  (0xffUL)                  /*!< DTR (Bitfield-Mask: 0xff)                             */
/* ==========================================================  RCR  ========================================================== */
#define ATIM_RCR_UD_Pos                   (9UL)                     /*!< UD (Bit 9)                                            */
#define ATIM_RCR_UD_Msk                   (0x200UL)                 /*!< UD (Bitfield-Mask: 0x01)                              */
#define ATIM_RCR_OV_Pos                   (8UL)                     /*!< OV (Bit 8)                                            */
#define ATIM_RCR_OV_Msk                   (0x100UL)                 /*!< OV (Bitfield-Mask: 0x01)                              */
#define ATIM_RCR_RCR_Pos                  (0UL)                     /*!< RCR (Bit 0)                                           */
#define ATIM_RCR_RCR_Msk                  (0xffUL)                  /*!< RCR (Bitfield-Mask: 0xff)                             */
/* ========================================================  CH1CCRA  ======================================================== */
#define ATIM_CH1CCRA_CCR1A_Pos            (0UL)                     /*!< CCR1A (Bit 0)                                         */
#define ATIM_CH1CCRA_CCR1A_Msk            (0xffffUL)                /*!< CCR1A (Bitfield-Mask: 0xffff)                         */
/* ========================================================  CH1CCRB  ======================================================== */
#define ATIM_CH1CCRB_CCR1B_Pos            (0UL)                     /*!< CCR1B (Bit 0)                                         */
#define ATIM_CH1CCRB_CCR1B_Msk            (0xffffUL)                /*!< CCR1B (Bitfield-Mask: 0xffff)                         */
/* ========================================================  CH2CCRA  ======================================================== */
#define ATIM_CH2CCRA_CCR2A_Pos            (0UL)                     /*!< CCR2A (Bit 0)                                         */
#define ATIM_CH2CCRA_CCR2A_Msk            (0xffffUL)                /*!< CCR2A (Bitfield-Mask: 0xffff)                         */
/* ========================================================  CH2CCRB  ======================================================== */
#define ATIM_CH2CCRB_CCR2B_Pos            (0UL)                     /*!< CCR2B (Bit 0)                                         */
#define ATIM_CH2CCRB_CCR2B_Msk            (0xffffUL)                /*!< CCR2B (Bitfield-Mask: 0xffff)                         */
/* ========================================================  CH3CCRA  ======================================================== */
#define ATIM_CH3CCRA_CCR3A_Pos            (0UL)                     /*!< CCR3A (Bit 0)                                         */
#define ATIM_CH3CCRA_CCR3A_Msk            (0xffffUL)                /*!< CCR3A (Bitfield-Mask: 0xffff)                         */
/* ========================================================  CH3CCRB  ======================================================== */
#define ATIM_CH3CCRB_CCR3B_Pos            (0UL)                     /*!< CCR3B (Bit 0)                                         */
#define ATIM_CH3CCRB_CCR3B_Msk            (0xffffUL)                /*!< CCR3B (Bitfield-Mask: 0xffff)                         */
/* ========================================================  CH4CCR  ========================================================= */
#define ATIM_CH4CCR_CCR4_Pos              (0UL)                     /*!< CCR4 (Bit 0)                                          */
#define ATIM_CH4CCR_CCR4_Msk              (0xffffUL)                /*!< CCR4 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CH4CR  ========================================================= */
#define ATIM_CH4CR_C4EN_Pos               (5UL)                     /*!< C4EN (Bit 5)                                          */
#define ATIM_CH4CR_C4EN_Msk               (0x20UL)                  /*!< C4EN (Bitfield-Mask: 0x01)                            */
#define ATIM_CH4CR_CIS_Pos                (3UL)                     /*!< CIS (Bit 3)                                           */
#define ATIM_CH4CR_CIS_Msk                (0x18UL)                  /*!< CIS (Bitfield-Mask: 0x03)                             */
#define ATIM_CH4CR_CDE_Pos                (2UL)                     /*!< CDE (Bit 2)                                           */
#define ATIM_CH4CR_CDE_Msk                (0x4UL)                   /*!< CDE (Bitfield-Mask: 0x01)                             */
#define ATIM_CH4CR_CIE_Pos                (1UL)                     /*!< CIE (Bit 1)                                           */
#define ATIM_CH4CR_CIE_Msk                (0x2UL)                   /*!< CIE (Bitfield-Mask: 0x01)                             */
#define ATIM_CH4CR_BUFE_Pos               (0UL)                     /*!< BUFE (Bit 0)                                          */
#define ATIM_CH4CR_BUFE_Msk               (0x1UL)                   /*!< BUFE (Bitfield-Mask: 0x01)                            */


/* =========================================================================================================================== */
/* ================                                         AUTOTRIM                                          ================ */
/* =========================================================================================================================== */

