CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052.h
/* ==========================================================  CR  =========================================================== */
#define AUTOTRIM_CR_OST_Pos               (11UL)                    /*!< OST (Bit 11)                                          */
#define AUTOTRIM_CR_OST_Msk               (0x800UL)                 /*!< OST (Bitfield-Mask: 0x01)                             */
#define AUTOTRIM_CR_SRC_Pos               (8UL)                     /*!< SRC (Bit 8)                                           */
#define AUTOTRIM_CR_SRC_Msk               (0x700UL)                 /*!< SRC (Bitfield-Mask: 0x07)                             */
#define AUTOTRIM_CR_PRS_Pos               (4UL)                     /*!< PRS (Bit 4)                                           */
#define AUTOTRIM_CR_PRS_Msk               (0xf0UL)                  /*!< PRS (Bitfield-Mask: 0x0f)                             */
#define AUTOTRIM_CR_AUTO_Pos              (3UL)                     /*!< AUTO (Bit 3)                                          */
#define AUTOTRIM_CR_AUTO_Msk              (0x8UL)                   /*!< AUTO (Bitfield-Mask: 0x01)                            */
#define AUTOTRIM_CR_MD_Pos                (1UL)                     /*!< MD (Bit 1)                                            */
#define AUTOTRIM_CR_MD_Msk                (0x6UL)                   /*!< MD (Bitfield-Mask: 0x03)                              */
#define AUTOTRIM_CR_EN_Pos                (0UL)                     /*!< EN (Bit 0)                                            */
#define AUTOTRIM_CR_EN_Msk                (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ==========================================================  ARR  ========================================================== */
#define AUTOTRIM_ARR_ARR_Pos              (0UL)                     /*!< ARR (Bit 0)                                           */
#define AUTOTRIM_ARR_ARR_Msk              (0xffffUL)                /*!< ARR (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  CNT  ========================================================== */
#define AUTOTRIM_CNT_CNT_Pos              (0UL)                     /*!< CNT (Bit 0)                                           */
#define AUTOTRIM_CNT_CNT_Msk              (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  IER  ========================================================== */
#define AUTOTRIM_IER_MISS_Pos             (5UL)                     /*!< MISS (Bit 5)                                          */
#define AUTOTRIM_IER_MISS_Msk             (0x20UL)                  /*!< MISS (Bitfield-Mask: 0x01)                            */
#define AUTOTRIM_IER_OV_Pos               (4UL)                     /*!< OV (Bit 4)                                            */
#define AUTOTRIM_IER_OV_Msk               (0x10UL)                  /*!< OV (Bitfield-Mask: 0x01)                              */
#define AUTOTRIM_IER_UD_Pos               (3UL)                     /*!< UD (Bit 3)                                            */
#define AUTOTRIM_IER_UD_Msk               (0x8UL)                   /*!< UD (Bitfield-Mask: 0x01)                              */
#define AUTOTRIM_IER_OK_Pos               (1UL)                     /*!< OK (Bit 1)                                            */
#define AUTOTRIM_IER_OK_Msk               (0x2UL)                   /*!< OK (Bitfield-Mask: 0x01)                              */
#define AUTOTRIM_IER_END_Pos              (0UL)                     /*!< END (Bit 0)                                           */
#define AUTOTRIM_IER_END_Msk              (0x1UL)                   /*!< END (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ISR  ========================================================== */
#define AUTOTRIM_ISR_MISS_Pos             (5UL)                     /*!< MISS (Bit 5)                                          */
#define AUTOTRIM_ISR_MISS_Msk             (0x20UL)                  /*!< MISS (Bitfield-Mask: 0x01)                            */
#define AUTOTRIM_ISR_OV_Pos               (4UL)                     /*!< OV (Bit 4)                                            */
#define AUTOTRIM_ISR_OV_Msk               (0x10UL)                  /*!< OV (Bitfield-Mask: 0x01)                              */
#define AUTOTRIM_ISR_UD_Pos               (3UL)                     /*!< UD (Bit 3)                                            */
#define AUTOTRIM_ISR_UD_Msk               (0x8UL)                   /*!< UD (Bitfield-Mask: 0x01)                              */
#define AUTOTRIM_ISR_OK_Pos               (1UL)                     /*!< OK (Bit 1)                                            */
#define AUTOTRIM_ISR_OK_Msk               (0x2UL)                   /*!< OK (Bitfield-Mask: 0x01)                              */
#define AUTOTRIM_ISR_END_Pos              (0UL)                     /*!< END (Bit 0)                                           */
#define AUTOTRIM_ISR_END_Msk              (0x1UL)                   /*!< END (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ICR  ========================================================== */
#define AUTOTRIM_ICR_MISS_Pos             (5UL)                     /*!< MISS (Bit 5)                                          */
#define AUTOTRIM_ICR_MISS_Msk             (0x20UL)                  /*!< MISS (Bitfield-Mask: 0x01)                            */
#define AUTOTRIM_ICR_OV_Pos               (4UL)                     /*!< OV (Bit 4)                                            */
#define AUTOTRIM_ICR_OV_Msk               (0x10UL)                  /*!< OV (Bitfield-Mask: 0x01)                              */
#define AUTOTRIM_ICR_UD_Pos               (3UL)                     /*!< UD (Bit 3)                                            */
#define AUTOTRIM_ICR_UD_Msk               (0x8UL)                   /*!< UD (Bitfield-Mask: 0x01)                              */
#define AUTOTRIM_ICR_OK_Pos               (1UL)                     /*!< OK (Bit 1)                                            */
#define AUTOTRIM_ICR_OK_Msk               (0x2UL)                   /*!< OK (Bitfield-Mask: 0x01)                              */
#define AUTOTRIM_ICR_END_Pos              (0UL)                     /*!< END (Bit 0)                                           */
#define AUTOTRIM_ICR_END_Msk              (0x1UL)                   /*!< END (Bitfield-Mask: 0x01)                             */
/* =========================================================  FCAP  ========================================================== */
#define AUTOTRIM_FCAP_FCAP_Pos            (0UL)                     /*!< FCAP (Bit 0)                                          */
#define AUTOTRIM_FCAP_FCAP_Msk            (0xffffUL)                /*!< FCAP (Bitfield-Mask: 0xffff)                          */
/* =========================================================  TVAL  ========================================================== */
#define AUTOTRIM_TVAL_TVAL_Pos            (0UL)                     /*!< TVAL (Bit 0)                                          */
#define AUTOTRIM_TVAL_TVAL_Msk            (0xffffUL)                /*!< TVAL (Bitfield-Mask: 0xffff)                          */
/* =========================================================  FLIM  ========================================================== */
#define AUTOTRIM_FLIM_FLIM_Pos            (0UL)                     /*!< FLIM (Bit 0)                                          */
#define AUTOTRIM_FLIM_FLIM_Msk            (0xffffUL)                /*!< FLIM (Bitfield-Mask: 0xffff)                          */


/* =========================================================================================================================== */
/* ================                                           BTIM                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  ARR  ========================================================== */
#define BTIMx_ARR_ARR_Pos                 (0UL)                     /*!< ARR (Bit 0)                                           */
#define BTIMx_ARR_ARR_Msk                 (0xffffUL)                /*!< ARR (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  CNT  ========================================================== */
#define BTIMx_CNT_CNT_Pos                 (0UL)                     /*!< CNT (Bit 0)                                           */
#define BTIMx_CNT_CNT_Msk                 (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  ETR  ========================================================== */
#define BTIMx_ETR_ETRFLT_Pos              (4UL)                     /*!< ETRFLT (Bit 4)                                        */
#define BTIMx_ETR_ETRFLT_Msk              (0x70UL)                  /*!< ETRFLT (Bitfield-Mask: 0x07)                          */
/* ==========================================================  CR  =========================================================== */
#define BTIMx_CR_TOGEN_Pos                (6UL)                     /*!< TOGEN (Bit 6)                                         */
#define BTIMx_CR_TOGEN_Msk                (0x40UL)                  /*!< TOGEN (Bitfield-Mask: 0x01)                           */
#define BTIMx_CR_ONESHOT_Pos              (5UL)                     /*!< ONESHOT (Bit 5)                                       */
#define BTIMx_CR_ONESHOT_Msk              (0x20UL)                  /*!< ONESHOT (Bitfield-Mask: 0x01)                         */
#define BTIMx_CR_POL_Pos                  (4UL)                     /*!< POL (Bit 4)                                           */
#define BTIMx_CR_POL_Msk                  (0x10UL)                  /*!< POL (Bitfield-Mask: 0x01)                             */
#define BTIMx_CR_TRS_Pos                  (3UL)                     /*!< TRS (Bit 3)                                           */
#define BTIMx_CR_TRS_Msk                  (0x8UL)                   /*!< TRS (Bitfield-Mask: 0x01)                             */
#define BTIMx_CR_MODE_Pos                 (1UL)                     /*!< MODE (Bit 1)                                          */
#define BTIMx_CR_MODE_Msk                 (0x6UL)                   /*!< MODE (Bitfield-Mask: 0x03)                            */
#define BTIMx_CR_EN_Pos                   (0UL)                     /*!< EN (Bit 0)                                            */
#define BTIMx_CR_EN_Msk                   (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ==========================================================  IER  ========================================================== */
#define BTIMx_IER_TOP_Pos                 (2UL)                     /*!< TOP (Bit 2)                                           */
#define BTIMx_IER_TOP_Msk                 (0x4UL)                   /*!< TOP (Bitfield-Mask: 0x01)                             */
#define BTIMx_IER_TI_Pos                  (1UL)                     /*!< TI (Bit 1)                                            */
#define BTIMx_IER_TI_Msk                  (0x2UL)                   /*!< TI (Bitfield-Mask: 0x01)                              */
#define BTIMx_IER_OV_Pos                  (0UL)                     /*!< OV (Bit 0)                                            */
#define BTIMx_IER_OV_Msk                  (0x1UL)                   /*!< OV (Bitfield-Mask: 0x01)                              */
/* ==========================================================  ISR  ========================================================== */
#define BTIMx_ISR_TOP_Pos                 (2UL)                     /*!< TOP (Bit 2)                                           */
#define BTIMx_ISR_TOP_Msk                 (0x4UL)                   /*!< TOP (Bitfield-Mask: 0x01)                             */
#define BTIMx_ISR_TI_Pos                  (1UL)                     /*!< TI (Bit 1)                                            */
#define BTIMx_ISR_TI_Msk                  (0x2UL)                   /*!< TI (Bitfield-Mask: 0x01)                              */
#define BTIMx_ISR_OV_Pos                  (0UL)                     /*!< OV (Bit 0)                                            */
#define BTIMx_ISR_OV_Msk                  (0x1UL)                   /*!< OV (Bitfield-Mask: 0x01)                              */
/* ==========================================================  ICR  ========================================================== */
#define BTIMx_ICR_TOP_Pos                 (2UL)                     /*!< TOP (Bit 2)                                           */
#define BTIMx_ICR_TOP_Msk                 (0x4UL)                   /*!< TOP (Bitfield-Mask: 0x01)                             */
#define BTIMx_ICR_TI_Pos                  (1UL)                     /*!< TI (Bit 1)                                            */
#define BTIMx_ICR_TI_Msk                  (0x2UL)                   /*!< TI (Bitfield-Mask: 0x01)                              */
#define BTIMx_ICR_OV_Pos                  (0UL)                     /*!< OV (Bit 0)                                            */
#define BTIMx_ICR_OV_Msk                  (0x1UL)                   /*!< OV (Bitfield-Mask: 0x01)                              */
/* ==========================================================  DMA  ========================================================== */
#define BTIMx_DMA_TRS_Pos                 (1UL)                     /*!< TRS (Bit 1)                                           */
#define BTIMx_DMA_TRS_Msk                 (0x2UL)                   /*!< TRS (Bitfield-Mask: 0x01)                             */
#define BTIMx_DMA_OV_Pos                  (0UL)                     /*!< OV (Bit 0)                                            */
#define BTIMx_DMA_OV_Msk                  (0x1UL)                   /*!< OV (Bitfield-Mask: 0x01)                              */
/* ==========================================================  PSC  ========================================================== */
#define BTIMx_PSC_PSC_Pos                 (0UL)                     /*!< PSC (Bit 0)                                           */
#define BTIMx_PSC_PSC_Msk                 (0xffffUL)                /*!< PSC (Bitfield-Mask: 0xffff)                           */


/* =========================================================================================================================== */
/* ================                                            CRC                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR  =========================================================== */
#define CRC_CR_MODE_Pos                   (0UL)                     /*!< MODE (Bit 0)                                          */
#define CRC_CR_MODE_Msk                   (0xfUL)                   /*!< MODE (Bitfield-Mask: 0x0f)                            */
/* =========================================================  INIT  ========================================================== */
#define CRC_INIT_INIT_Pos                 (0UL)                     /*!< INIT (Bit 0)                                          */
#define CRC_INIT_INIT_Msk                 (0xffffUL)                /*!< INIT (Bitfield-Mask: 0xffff)                          */
/* ==========================================================  DR  =========================================================== */
#define CRC_DR_DR_Pos                     (0UL)                     /*!< DR (Bit 0)                                            */
#define CRC_DR_DR_Msk                     (0xffUL)                  /*!< DR (Bitfield-Mask: 0xff)                              */
/* ========================================================  RESULT  ========================================================= */
#define CRC_RESULT_RESULT_Pos             (0UL)                     /*!< RESULT (Bit 0)                                        */
#define CRC_RESULT_RESULT_Msk             (0xffffUL)                /*!< RESULT (Bitfield-Mask: 0xffff)                        */


/* =========================================================================================================================== */
/* ================                                            DMA                                            ================ */
/* =========================================================================================================================== */

