CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052.h
/* =========================================================  BRREN  ========================================================= */
#define I2Cx_BRREN_EN_Pos                 (0UL)                     /*!< EN (Bit 0)                                            */
#define I2Cx_BRREN_EN_Msk                 (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ==========================================================  BRR  ========================================================== */
#define I2Cx_BRR_BRR_Pos                  (0UL)                     /*!< BRR (Bit 0)                                           */
#define I2Cx_BRR_BRR_Msk                  (0xffUL)                  /*!< BRR (Bitfield-Mask: 0xff)                             */
/* ==========================================================  CR  =========================================================== */
#define I2Cx_CR_EN_Pos                    (6UL)                     /*!< EN (Bit 6)                                            */
#define I2Cx_CR_EN_Msk                    (0x40UL)                  /*!< EN (Bitfield-Mask: 0x01)                              */
#define I2Cx_CR_STA_Pos                   (5UL)                     /*!< STA (Bit 5)                                           */
#define I2Cx_CR_STA_Msk                   (0x20UL)                  /*!< STA (Bitfield-Mask: 0x01)                             */
#define I2Cx_CR_STO_Pos                   (4UL)                     /*!< STO (Bit 4)                                           */
#define I2Cx_CR_STO_Msk                   (0x10UL)                  /*!< STO (Bitfield-Mask: 0x01)                             */
#define I2Cx_CR_SI_Pos                    (3UL)                     /*!< SI (Bit 3)                                            */
#define I2Cx_CR_SI_Msk                    (0x8UL)                   /*!< SI (Bitfield-Mask: 0x01)                              */
#define I2Cx_CR_AA_Pos                    (2UL)                     /*!< AA (Bit 2)                                            */
#define I2Cx_CR_AA_Msk                    (0x4UL)                   /*!< AA (Bitfield-Mask: 0x01)                              */
#define I2Cx_CR_FLT_Pos                   (0UL)                     /*!< FLT (Bit 0)                                           */
#define I2Cx_CR_FLT_Msk                   (0x1UL)                   /*!< FLT (Bitfield-Mask: 0x01)                             */
/* ==========================================================  DR  =========================================================== */
#define I2Cx_DR_DR_Pos                    (0UL)                     /*!< DR (Bit 0)                                            */
#define I2Cx_DR_DR_Msk                    (0xffUL)                  /*!< DR (Bitfield-Mask: 0xff)                              */
/* =========================================================  STAT  ========================================================== */
#define I2Cx_STAT_STAT_Pos                (0UL)                     /*!< STAT (Bit 0)                                          */
#define I2Cx_STAT_STAT_Msk                (0xffUL)                  /*!< STAT (Bitfield-Mask: 0xff)                            */
/* =========================================================  ADDR0  ========================================================= */
#define I2Cx_ADDR0_ADDR0_Pos              (1UL)                     /*!< ADDR0 (Bit 1)                                         */
#define I2Cx_ADDR0_ADDR0_Msk              (0xfeUL)                  /*!< ADDR0 (Bitfield-Mask: 0x7f)                           */
#define I2Cx_ADDR0_GC_Pos                 (0UL)                     /*!< GC (Bit 0)                                            */
#define I2Cx_ADDR0_GC_Msk                 (0x1UL)                   /*!< GC (Bitfield-Mask: 0x01)                              */
/* =========================================================  ADDR1  ========================================================= */
#define I2Cx_ADDR1_ADDR1_Pos              (1UL)                     /*!< ADDR1 (Bit 1)                                         */
#define I2Cx_ADDR1_ADDR1_Msk              (0xfeUL)                  /*!< ADDR1 (Bitfield-Mask: 0x7f)                           */
/* =========================================================  ADDR2  ========================================================= */
#define I2Cx_ADDR2_ADDR2_Pos              (1UL)                     /*!< ADDR2 (Bit 1)                                         */
#define I2Cx_ADDR2_ADDR2_Msk              (0xfeUL)                  /*!< ADDR2 (Bitfield-Mask: 0x7f)                           */
/* =========================================================  MATCH  ========================================================= */
#define I2Cx_MATCH_ADDR2_Pos              (2UL)                     /*!< ADDR2 (Bit 2)                                         */
#define I2Cx_MATCH_ADDR2_Msk              (0x4UL)                   /*!< ADDR2 (Bitfield-Mask: 0x01)                           */
#define I2Cx_MATCH_ADDR1_Pos              (1UL)                     /*!< ADDR1 (Bit 1)                                         */
#define I2Cx_MATCH_ADDR1_Msk              (0x2UL)                   /*!< ADDR1 (Bitfield-Mask: 0x01)                           */
#define I2Cx_MATCH_ADDR0_Pos              (0UL)                     /*!< ADDR0 (Bit 0)                                         */
#define I2Cx_MATCH_ADDR0_Msk              (0x1UL)                   /*!< ADDR0 (Bitfield-Mask: 0x01)                           */


/* =========================================================================================================================== */
/* ================                                           IWDT                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  KR  =========================================================== */
#define IWDT_KR_KR_Pos                    (0UL)                     /*!< KR (Bit 0)                                            */
#define IWDT_KR_KR_Msk                    (0xffffUL)                /*!< KR (Bitfield-Mask: 0xffff)                            */
/* ==========================================================  CR  =========================================================== */
#define IWDT_CR_PAUSE_Pos                 (5UL)                     /*!< PAUSE (Bit 5)                                         */
#define IWDT_CR_PAUSE_Msk                 (0x20UL)                  /*!< PAUSE (Bitfield-Mask: 0x01)                           */
#define IWDT_CR_IE_Pos                    (4UL)                     /*!< IE (Bit 4)                                            */
#define IWDT_CR_IE_Msk                    (0x10UL)                  /*!< IE (Bitfield-Mask: 0x01)                              */
#define IWDT_CR_ACTION_Pos                (3UL)                     /*!< ACTION (Bit 3)                                        */
#define IWDT_CR_ACTION_Msk                (0x8UL)                   /*!< ACTION (Bitfield-Mask: 0x01)                          */
#define IWDT_CR_PRS_Pos                   (0UL)                     /*!< PRS (Bit 0)                                           */
#define IWDT_CR_PRS_Msk                   (0x7UL)                   /*!< PRS (Bitfield-Mask: 0x07)                             */
/* ==========================================================  ARR  ========================================================== */
#define IWDT_ARR_ARR_Pos                  (0UL)                     /*!< ARR (Bit 0)                                           */
#define IWDT_ARR_ARR_Msk                  (0xfffUL)                 /*!< ARR (Bitfield-Mask: 0xfff)                            */
/* =========================================================  WINR  ========================================================== */
#define IWDT_WINR_WINR_Pos                (0UL)                     /*!< WINR (Bit 0)                                          */
#define IWDT_WINR_WINR_Msk                (0xfffUL)                 /*!< WINR (Bitfield-Mask: 0xfff)                           */
/* ==========================================================  SR  =========================================================== */
#define IWDT_SR_RELOAD_Pos                (5UL)                     /*!< RELOAD (Bit 5)                                        */
#define IWDT_SR_RELOAD_Msk                (0x20UL)                  /*!< RELOAD (Bitfield-Mask: 0x01)                          */
#define IWDT_SR_RUN_Pos                   (4UL)                     /*!< RUN (Bit 4)                                           */
#define IWDT_SR_RUN_Msk                   (0x10UL)                  /*!< RUN (Bitfield-Mask: 0x01)                             */
#define IWDT_SR_OV_Pos                    (3UL)                     /*!< OV (Bit 3)                                            */
#define IWDT_SR_OV_Msk                    (0x8UL)                   /*!< OV (Bitfield-Mask: 0x01)                              */
#define IWDT_SR_WINRF_Pos                 (2UL)                     /*!< WINRF (Bit 2)                                         */
#define IWDT_SR_WINRF_Msk                 (0x4UL)                   /*!< WINRF (Bitfield-Mask: 0x01)                           */
#define IWDT_SR_ARRF_Pos                  (1UL)                     /*!< ARRF (Bit 1)                                          */
#define IWDT_SR_ARRF_Msk                  (0x2UL)                   /*!< ARRF (Bitfield-Mask: 0x01)                            */
#define IWDT_SR_CRF_Pos                   (0UL)                     /*!< CRF (Bit 0)                                           */
#define IWDT_SR_CRF_Msk                   (0x1UL)                   /*!< CRF (Bitfield-Mask: 0x01)                             */
/* ==========================================================  CNT  ========================================================== */
#define IWDT_CNT_CNT_Pos                  (0UL)                     /*!< CNT (Bit 0)                                           */
#define IWDT_CNT_CNT_Msk                  (0xfffUL)                 /*!< CNT (Bitfield-Mask: 0xfff)                            */


/* =========================================================================================================================== */
/* ================                                            LCD                                            ================ */
/* =========================================================================================================================== */

