CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052.h
/* ==========================================================  CR0  ========================================================== */
#define LCD_CR0_CONTRAST_Pos              (12UL)                    /*!< CONTRAST (Bit 12)                                     */
#define LCD_CR0_CONTRAST_Msk              (0xf000UL)                /*!< CONTRAST (Bitfield-Mask: 0x0f)                        */
#define LCD_CR0_INRS_Pos                  (9UL)                     /*!< INRS (Bit 9)                                          */
#define LCD_CR0_INRS_Msk                  (0xe00UL)                 /*!< INRS (Bitfield-Mask: 0x07)                            */
#define LCD_CR0_DUTY_Pos                  (6UL)                     /*!< DUTY (Bit 6)                                          */
#define LCD_CR0_DUTY_Msk                  (0x1c0UL)                 /*!< DUTY (Bitfield-Mask: 0x07)                            */
#define LCD_CR0_BIAS_Pos                  (4UL)                     /*!< BIAS (Bit 4)                                          */
#define LCD_CR0_BIAS_Msk                  (0x10UL)                  /*!< BIAS (Bitfield-Mask: 0x01)                            */
#define LCD_CR0_BUMP_Pos                  (3UL)                     /*!< BUMP (Bit 3)                                          */
#define LCD_CR0_BUMP_Msk                  (0x8UL)                   /*!< BUMP (Bitfield-Mask: 0x01)                            */
#define LCD_CR0_CPCLK_Pos                 (1UL)                     /*!< CPCLK (Bit 1)                                         */
#define LCD_CR0_CPCLK_Msk                 (0x6UL)                   /*!< CPCLK (Bitfield-Mask: 0x03)                           */
#define LCD_CR0_EN_Pos                    (0UL)                     /*!< EN (Bit 0)                                            */
#define LCD_CR0_EN_Msk                    (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ==========================================================  CR1  ========================================================== */
#define LCD_CR1_INTF_Pos                  (12UL)                    /*!< INTF (Bit 12)                                         */
#define LCD_CR1_INTF_Msk                  (0x1000UL)                /*!< INTF (Bitfield-Mask: 0x01)                            */
#define LCD_CR1_IE_Pos                    (11UL)                    /*!< IE (Bit 11)                                           */
#define LCD_CR1_IE_Msk                    (0x800UL)                 /*!< IE (Bitfield-Mask: 0x01)                              */
#define LCD_CR1_DMAEN_Pos                 (10UL)                    /*!< DMAEN (Bit 10)                                        */
#define LCD_CR1_DMAEN_Msk                 (0x400UL)                 /*!< DMAEN (Bitfield-Mask: 0x01)                           */
#define LCD_CR1_LCDFS_Pos                 (8UL)                     /*!< LCDFS (Bit 8)                                         */
#define LCD_CR1_LCDFS_Msk                 (0x300UL)                 /*!< LCDFS (Bitfield-Mask: 0x03)                           */
#define LCD_CR1_CLKCS_Pos                 (7UL)                     /*!< CLKCS (Bit 7)                                         */
#define LCD_CR1_CLKCS_Msk                 (0x80UL)                  /*!< CLKCS (Bitfield-Mask: 0x01)                           */
#define LCD_CR1_BLINKEN_Pos               (6UL)                     /*!< BLINKEN (Bit 6)                                       */
#define LCD_CR1_BLINKEN_Msk               (0x40UL)                  /*!< BLINKEN (Bitfield-Mask: 0x01)                         */
#define LCD_CR1_BLINKCNT_Pos              (0UL)                     /*!< BLINKCNT (Bit 0)                                      */
#define LCD_CR1_BLINKCNT_Msk              (0x3fUL)                  /*!< BLINKCNT (Bitfield-Mask: 0x3f)                        */
/* ==========================================================  ICR  ========================================================== */
#define LCD_ICR_INTF_Pos                  (12UL)                    /*!< INTF (Bit 12)                                         */
#define LCD_ICR_INTF_Msk                  (0x1000UL)                /*!< INTF (Bitfield-Mask: 0x01)                            */
/* ========================================================  PINEN1  ========================================================= */
#define LCD_PINEN1_SEG31COM4_Pos          (31UL)                    /*!< SEG31COM4 (Bit 31)                                    */
#define LCD_PINEN1_SEG31COM4_Msk          (0x80000000UL)            /*!< SEG31COM4 (Bitfield-Mask: 0x01)                       */
#define LCD_PINEN1_SEG30COM5_Pos          (30UL)                    /*!< SEG30COM5 (Bit 30)                                    */
#define LCD_PINEN1_SEG30COM5_Msk          (0x40000000UL)            /*!< SEG30COM5 (Bitfield-Mask: 0x01)                       */
#define LCD_PINEN1_SEG29COM6_Pos          (29UL)                    /*!< SEG29COM6 (Bit 29)                                    */
#define LCD_PINEN1_SEG29COM6_Msk          (0x20000000UL)            /*!< SEG29COM6 (Bitfield-Mask: 0x01)                       */
#define LCD_PINEN1_SEG28COM7_Pos          (28UL)                    /*!< SEG28COM7 (Bit 28)                                    */
#define LCD_PINEN1_SEG28COM7_Msk          (0x10000000UL)            /*!< SEG28COM7 (Bitfield-Mask: 0x01)                       */
#define LCD_PINEN1_SEG27VLCD4_Pos         (27UL)                    /*!< SEG27VLCD4 (Bit 27)                                   */
#define LCD_PINEN1_SEG27VLCD4_Msk         (0x8000000UL)             /*!< SEG27VLCD4 (Bitfield-Mask: 0x01)                      */
#define LCD_PINEN1_SEG26VLCD3_Pos         (26UL)                    /*!< SEG26VLCD3 (Bit 26)                                   */
#define LCD_PINEN1_SEG26VLCD3_Msk         (0x4000000UL)             /*!< SEG26VLCD3 (Bitfield-Mask: 0x01)                      */
#define LCD_PINEN1_SEG25VLCD2_Pos         (25UL)                    /*!< SEG25VLCD2 (Bit 25)                                   */
#define LCD_PINEN1_SEG25VLCD2_Msk         (0x2000000UL)             /*!< SEG25VLCD2 (Bitfield-Mask: 0x01)                      */
#define LCD_PINEN1_SEG24VLCD1_Pos         (24UL)                    /*!< SEG24VLCD1 (Bit 24)                                   */
#define LCD_PINEN1_SEG24VLCD1_Msk         (0x1000000UL)             /*!< SEG24VLCD1 (Bitfield-Mask: 0x01)                      */
#define LCD_PINEN1_SEG23_Pos              (23UL)                    /*!< SEG23 (Bit 23)                                        */
#define LCD_PINEN1_SEG23_Msk              (0x800000UL)              /*!< SEG23 (Bitfield-Mask: 0x01)                           */
#define LCD_PINEN1_SEG22_Pos              (22UL)                    /*!< SEG22 (Bit 22)                                        */
#define LCD_PINEN1_SEG22_Msk              (0x400000UL)              /*!< SEG22 (Bitfield-Mask: 0x01)                           */
#define LCD_PINEN1_SEG21_Pos              (21UL)                    /*!< SEG21 (Bit 21)                                        */
#define LCD_PINEN1_SEG21_Msk              (0x200000UL)              /*!< SEG21 (Bitfield-Mask: 0x01)                           */
#define LCD_PINEN1_SEG20_Pos              (20UL)                    /*!< SEG20 (Bit 20)                                        */
#define LCD_PINEN1_SEG20_Msk              (0x100000UL)              /*!< SEG20 (Bitfield-Mask: 0x01)                           */
#define LCD_PINEN1_SEG19_Pos              (19UL)                    /*!< SEG19 (Bit 19)                                        */
#define LCD_PINEN1_SEG19_Msk              (0x80000UL)               /*!< SEG19 (Bitfield-Mask: 0x01)                           */
#define LCD_PINEN1_SEG18_Pos              (18UL)                    /*!< SEG18 (Bit 18)                                        */
#define LCD_PINEN1_SEG18_Msk              (0x40000UL)               /*!< SEG18 (Bitfield-Mask: 0x01)                           */
#define LCD_PINEN1_SEG17_Pos              (17UL)                    /*!< SEG17 (Bit 17)                                        */
#define LCD_PINEN1_SEG17_Msk              (0x20000UL)               /*!< SEG17 (Bitfield-Mask: 0x01)                           */
#define LCD_PINEN1_SEG16_Pos              (16UL)                    /*!< SEG16 (Bit 16)                                        */
#define LCD_PINEN1_SEG16_Msk              (0x10000UL)               /*!< SEG16 (Bitfield-Mask: 0x01)                           */
#define LCD_PINEN1_SEG15_Pos              (15UL)                    /*!< SEG15 (Bit 15)                                        */
#define LCD_PINEN1_SEG15_Msk              (0x8000UL)                /*!< SEG15 (Bitfield-Mask: 0x01)                           */
#define LCD_PINEN1_SEG14_Pos              (14UL)                    /*!< SEG14 (Bit 14)                                        */
#define LCD_PINEN1_SEG14_Msk              (0x4000UL)                /*!< SEG14 (Bitfield-Mask: 0x01)                           */
#define LCD_PINEN1_SEG13_Pos              (13UL)                    /*!< SEG13 (Bit 13)                                        */
#define LCD_PINEN1_SEG13_Msk              (0x2000UL)                /*!< SEG13 (Bitfield-Mask: 0x01)                           */
#define LCD_PINEN1_SEG12_Pos              (12UL)                    /*!< SEG12 (Bit 12)                                        */
#define LCD_PINEN1_SEG12_Msk              (0x1000UL)                /*!< SEG12 (Bitfield-Mask: 0x01)                           */
#define LCD_PINEN1_SEG11_Pos              (11UL)                    /*!< SEG11 (Bit 11)                                        */
#define LCD_PINEN1_SEG11_Msk              (0x800UL)                 /*!< SEG11 (Bitfield-Mask: 0x01)                           */
#define LCD_PINEN1_SEG10_Pos              (10UL)                    /*!< SEG10 (Bit 10)                                        */
#define LCD_PINEN1_SEG10_Msk              (0x400UL)                 /*!< SEG10 (Bitfield-Mask: 0x01)                           */
#define LCD_PINEN1_SEG9_Pos               (9UL)                     /*!< SEG9 (Bit 9)                                          */
#define LCD_PINEN1_SEG9_Msk               (0x200UL)                 /*!< SEG9 (Bitfield-Mask: 0x01)                            */
#define LCD_PINEN1_SEG8_Pos               (8UL)                     /*!< SEG8 (Bit 8)                                          */
#define LCD_PINEN1_SEG8_Msk               (0x100UL)                 /*!< SEG8 (Bitfield-Mask: 0x01)                            */
#define LCD_PINEN1_SEG7_Pos               (7UL)                     /*!< SEG7 (Bit 7)                                          */
#define LCD_PINEN1_SEG7_Msk               (0x80UL)                  /*!< SEG7 (Bitfield-Mask: 0x01)                            */
#define LCD_PINEN1_SEG6_Pos               (6UL)                     /*!< SEG6 (Bit 6)                                          */
#define LCD_PINEN1_SEG6_Msk               (0x40UL)                  /*!< SEG6 (Bitfield-Mask: 0x01)                            */
#define LCD_PINEN1_SEG5_Pos               (5UL)                     /*!< SEG5 (Bit 5)                                          */
#define LCD_PINEN1_SEG5_Msk               (0x20UL)                  /*!< SEG5 (Bitfield-Mask: 0x01)                            */
#define LCD_PINEN1_SEG4_Pos               (4UL)                     /*!< SEG4 (Bit 4)                                          */
#define LCD_PINEN1_SEG4_Msk               (0x10UL)                  /*!< SEG4 (Bitfield-Mask: 0x01)                            */
#define LCD_PINEN1_SEG3_Pos               (3UL)                     /*!< SEG3 (Bit 3)                                          */
#define LCD_PINEN1_SEG3_Msk               (0x8UL)                   /*!< SEG3 (Bitfield-Mask: 0x01)                            */
#define LCD_PINEN1_SEG2_Pos               (2UL)                     /*!< SEG2 (Bit 2)                                          */
#define LCD_PINEN1_SEG2_Msk               (0x4UL)                   /*!< SEG2 (Bitfield-Mask: 0x01)                            */
#define LCD_PINEN1_SEG1_Pos               (1UL)                     /*!< SEG1 (Bit 1)                                          */
#define LCD_PINEN1_SEG1_Msk               (0x2UL)                   /*!< SEG1 (Bitfield-Mask: 0x01)                            */
#define LCD_PINEN1_SEG0_Pos               (0UL)                     /*!< SEG0 (Bit 0)                                          */
#define LCD_PINEN1_SEG0_Msk               (0x1UL)                   /*!< SEG0 (Bitfield-Mask: 0x01)                            */
/* ========================================================  PINEN2  ========================================================= */
#define LCD_PINEN2_MUX_Pos                (28UL)                    /*!< MUX (Bit 28)                                          */
#define LCD_PINEN2_MUX_Msk                (0x10000000UL)            /*!< MUX (Bitfield-Mask: 0x01)                             */
#define LCD_PINEN2_COM3_Pos               (27UL)                    /*!< COM3 (Bit 27)                                         */
#define LCD_PINEN2_COM3_Msk               (0x8000000UL)             /*!< COM3 (Bitfield-Mask: 0x01)                            */
#define LCD_PINEN2_COM2_Pos               (26UL)                    /*!< COM2 (Bit 26)                                         */
#define LCD_PINEN2_COM2_Msk               (0x4000000UL)             /*!< COM2 (Bitfield-Mask: 0x01)                            */
#define LCD_PINEN2_COM1_Pos               (25UL)                    /*!< COM1 (Bit 25)                                         */
#define LCD_PINEN2_COM1_Msk               (0x2000000UL)             /*!< COM1 (Bitfield-Mask: 0x01)                            */
#define LCD_PINEN2_COM0_Pos               (24UL)                    /*!< COM0 (Bit 24)                                         */
#define LCD_PINEN2_COM0_Msk               (0x1000000UL)             /*!< COM0 (Bitfield-Mask: 0x01)                            */
#define LCD_PINEN2_SEG55_Pos              (23UL)                    /*!< SEG55 (Bit 23)                                        */
#define LCD_PINEN2_SEG55_Msk              (0x800000UL)              /*!< SEG55 (Bitfield-Mask: 0x01)                           */
#define LCD_PINEN2_SEG54_Pos              (22UL)                    /*!< SEG54 (Bit 22)                                        */
#define LCD_PINEN2_SEG54_Msk              (0x400000UL)              /*!< SEG54 (Bitfield-Mask: 0x01)                           */
#define LCD_PINEN2_SEG53_Pos              (21UL)                    /*!< SEG53 (Bit 21)                                        */
#define LCD_PINEN2_SEG53_Msk              (0x200000UL)              /*!< SEG53 (Bitfield-Mask: 0x01)                           */
#define LCD_PINEN2_SEG52_Pos              (20UL)                    /*!< SEG52 (Bit 20)                                        */
#define LCD_PINEN2_SEG52_Msk              (0x100000UL)              /*!< SEG52 (Bitfield-Mask: 0x01)                           */
#define LCD_PINEN2_SEG35_Pos              (3UL)                     /*!< SEG35 (Bit 3)                                         */
#define LCD_PINEN2_SEG35_Msk              (0x8UL)                   /*!< SEG35 (Bitfield-Mask: 0x01)                           */
#define LCD_PINEN2_SEG34_Pos              (2UL)                     /*!< SEG34 (Bit 2)                                         */
#define LCD_PINEN2_SEG34_Msk              (0x4UL)                   /*!< SEG34 (Bitfield-Mask: 0x01)                           */
#define LCD_PINEN2_SEG33_Pos              (1UL)                     /*!< SEG33 (Bit 1)                                         */
#define LCD_PINEN2_SEG33_Msk              (0x2UL)                   /*!< SEG33 (Bitfield-Mask: 0x01)                           */
#define LCD_PINEN2_SEG32_Pos              (0UL)                     /*!< SEG32 (Bit 0)                                         */
#define LCD_PINEN2_SEG32_Msk              (0x1UL)                   /*!< SEG32 (Bitfield-Mask: 0x01)                           */
/* =========================================================  RAM0  ========================================================== */
#define LCD_RAM0_D31_Pos                  (31UL)                    /*!< D31 (Bit 31)                                          */
#define LCD_RAM0_D31_Msk                  (0x80000000UL)            /*!< D31 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM0_D30_Pos                  (30UL)                    /*!< D30 (Bit 30)                                          */
#define LCD_RAM0_D30_Msk                  (0x40000000UL)            /*!< D30 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM0_D29_Pos                  (29UL)                    /*!< D29 (Bit 29)                                          */
#define LCD_RAM0_D29_Msk                  (0x20000000UL)            /*!< D29 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM0_D28_Pos                  (28UL)                    /*!< D28 (Bit 28)                                          */
#define LCD_RAM0_D28_Msk                  (0x10000000UL)            /*!< D28 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM0_D27_Pos                  (27UL)                    /*!< D27 (Bit 27)                                          */
#define LCD_RAM0_D27_Msk                  (0x8000000UL)             /*!< D27 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM0_D26_Pos                  (26UL)                    /*!< D26 (Bit 26)                                          */
#define LCD_RAM0_D26_Msk                  (0x4000000UL)             /*!< D26 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM0_D25_Pos                  (25UL)                    /*!< D25 (Bit 25)                                          */
#define LCD_RAM0_D25_Msk                  (0x2000000UL)             /*!< D25 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM0_D24_Pos                  (24UL)                    /*!< D24 (Bit 24)                                          */
#define LCD_RAM0_D24_Msk                  (0x1000000UL)             /*!< D24 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM0_D23_Pos                  (23UL)                    /*!< D23 (Bit 23)                                          */
#define LCD_RAM0_D23_Msk                  (0x800000UL)              /*!< D23 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM0_D22_Pos                  (22UL)                    /*!< D22 (Bit 22)                                          */
#define LCD_RAM0_D22_Msk                  (0x400000UL)              /*!< D22 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM0_D21_Pos                  (21UL)                    /*!< D21 (Bit 21)                                          */
#define LCD_RAM0_D21_Msk                  (0x200000UL)              /*!< D21 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM0_D20_Pos                  (20UL)                    /*!< D20 (Bit 20)                                          */
#define LCD_RAM0_D20_Msk                  (0x100000UL)              /*!< D20 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM0_D19_Pos                  (19UL)                    /*!< D19 (Bit 19)                                          */
#define LCD_RAM0_D19_Msk                  (0x80000UL)               /*!< D19 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM0_D18_Pos                  (18UL)                    /*!< D18 (Bit 18)                                          */
#define LCD_RAM0_D18_Msk                  (0x40000UL)               /*!< D18 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM0_D17_Pos                  (17UL)                    /*!< D17 (Bit 17)                                          */
#define LCD_RAM0_D17_Msk                  (0x20000UL)               /*!< D17 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM0_D16_Pos                  (16UL)                    /*!< D16 (Bit 16)                                          */
#define LCD_RAM0_D16_Msk                  (0x10000UL)               /*!< D16 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM0_D15_Pos                  (15UL)                    /*!< D15 (Bit 15)                                          */
#define LCD_RAM0_D15_Msk                  (0x8000UL)                /*!< D15 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM0_D14_Pos                  (14UL)                    /*!< D14 (Bit 14)                                          */
#define LCD_RAM0_D14_Msk                  (0x4000UL)                /*!< D14 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM0_D13_Pos                  (13UL)                    /*!< D13 (Bit 13)                                          */
#define LCD_RAM0_D13_Msk                  (0x2000UL)                /*!< D13 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM0_D12_Pos                  (12UL)                    /*!< D12 (Bit 12)                                          */
#define LCD_RAM0_D12_Msk                  (0x1000UL)                /*!< D12 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM0_D11_Pos                  (11UL)                    /*!< D11 (Bit 11)                                          */
#define LCD_RAM0_D11_Msk                  (0x800UL)                 /*!< D11 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM0_D10_Pos                  (10UL)                    /*!< D10 (Bit 10)                                          */
#define LCD_RAM0_D10_Msk                  (0x400UL)                 /*!< D10 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM0_D9_Pos                   (9UL)                     /*!< D9 (Bit 9)                                            */
#define LCD_RAM0_D9_Msk                   (0x200UL)                 /*!< D9 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM0_D8_Pos                   (8UL)                     /*!< D8 (Bit 8)                                            */
#define LCD_RAM0_D8_Msk                   (0x100UL)                 /*!< D8 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM0_D7_Pos                   (7UL)                     /*!< D7 (Bit 7)                                            */
#define LCD_RAM0_D7_Msk                   (0x80UL)                  /*!< D7 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM0_D6_Pos                   (6UL)                     /*!< D6 (Bit 6)                                            */
#define LCD_RAM0_D6_Msk                   (0x40UL)                  /*!< D6 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM0_D5_Pos                   (5UL)                     /*!< D5 (Bit 5)                                            */
#define LCD_RAM0_D5_Msk                   (0x20UL)                  /*!< D5 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM0_D4_Pos                   (4UL)                     /*!< D4 (Bit 4)                                            */
#define LCD_RAM0_D4_Msk                   (0x10UL)                  /*!< D4 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM0_D3_Pos                   (3UL)                     /*!< D3 (Bit 3)                                            */
#define LCD_RAM0_D3_Msk                   (0x8UL)                   /*!< D3 (Bitfield-Mask: 0x01)                              */
