CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052.h
#define LCD_RAM9_D19_Msk                  (0x80000UL)               /*!< D19 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM9_D18_Pos                  (18UL)                    /*!< D18 (Bit 18)                                          */
#define LCD_RAM9_D18_Msk                  (0x40000UL)               /*!< D18 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM9_D17_Pos                  (17UL)                    /*!< D17 (Bit 17)                                          */
#define LCD_RAM9_D17_Msk                  (0x20000UL)               /*!< D17 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM9_D16_Pos                  (16UL)                    /*!< D16 (Bit 16)                                          */
#define LCD_RAM9_D16_Msk                  (0x10000UL)               /*!< D16 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM9_D15_Pos                  (15UL)                    /*!< D15 (Bit 15)                                          */
#define LCD_RAM9_D15_Msk                  (0x8000UL)                /*!< D15 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM9_D14_Pos                  (14UL)                    /*!< D14 (Bit 14)                                          */
#define LCD_RAM9_D14_Msk                  (0x4000UL)                /*!< D14 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM9_D13_Pos                  (13UL)                    /*!< D13 (Bit 13)                                          */
#define LCD_RAM9_D13_Msk                  (0x2000UL)                /*!< D13 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM9_D12_Pos                  (12UL)                    /*!< D12 (Bit 12)                                          */
#define LCD_RAM9_D12_Msk                  (0x1000UL)                /*!< D12 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM9_D11_Pos                  (11UL)                    /*!< D11 (Bit 11)                                          */
#define LCD_RAM9_D11_Msk                  (0x800UL)                 /*!< D11 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM9_D10_Pos                  (10UL)                    /*!< D10 (Bit 10)                                          */
#define LCD_RAM9_D10_Msk                  (0x400UL)                 /*!< D10 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM9_D9_Pos                   (9UL)                     /*!< D9 (Bit 9)                                            */
#define LCD_RAM9_D9_Msk                   (0x200UL)                 /*!< D9 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM9_D8_Pos                   (8UL)                     /*!< D8 (Bit 8)                                            */
#define LCD_RAM9_D8_Msk                   (0x100UL)                 /*!< D8 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM9_D7_Pos                   (7UL)                     /*!< D7 (Bit 7)                                            */
#define LCD_RAM9_D7_Msk                   (0x80UL)                  /*!< D7 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM9_D6_Pos                   (6UL)                     /*!< D6 (Bit 6)                                            */
#define LCD_RAM9_D6_Msk                   (0x40UL)                  /*!< D6 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM9_D5_Pos                   (5UL)                     /*!< D5 (Bit 5)                                            */
#define LCD_RAM9_D5_Msk                   (0x20UL)                  /*!< D5 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM9_D4_Pos                   (4UL)                     /*!< D4 (Bit 4)                                            */
#define LCD_RAM9_D4_Msk                   (0x10UL)                  /*!< D4 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM9_D3_Pos                   (3UL)                     /*!< D3 (Bit 3)                                            */
#define LCD_RAM9_D3_Msk                   (0x8UL)                   /*!< D3 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM9_D2_Pos                   (2UL)                     /*!< D2 (Bit 2)                                            */
#define LCD_RAM9_D2_Msk                   (0x4UL)                   /*!< D2 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM9_D1_Pos                   (1UL)                     /*!< D1 (Bit 1)                                            */
#define LCD_RAM9_D1_Msk                   (0x2UL)                   /*!< D1 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM9_D0_Pos                   (0UL)                     /*!< D0 (Bit 0)                                            */
#define LCD_RAM9_D0_Msk                   (0x1UL)                   /*!< D0 (Bitfield-Mask: 0x01)                              */
/* =========================================================  RAM10  ========================================================= */
#define LCD_RAM10_D31_Pos                 (31UL)                    /*!< D31 (Bit 31)                                          */
#define LCD_RAM10_D31_Msk                 (0x80000000UL)            /*!< D31 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM10_D30_Pos                 (30UL)                    /*!< D30 (Bit 30)                                          */
#define LCD_RAM10_D30_Msk                 (0x40000000UL)            /*!< D30 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM10_D29_Pos                 (29UL)                    /*!< D29 (Bit 29)                                          */
#define LCD_RAM10_D29_Msk                 (0x20000000UL)            /*!< D29 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM10_D28_Pos                 (28UL)                    /*!< D28 (Bit 28)                                          */
#define LCD_RAM10_D28_Msk                 (0x10000000UL)            /*!< D28 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM10_D27_Pos                 (27UL)                    /*!< D27 (Bit 27)                                          */
#define LCD_RAM10_D27_Msk                 (0x8000000UL)             /*!< D27 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM10_D26_Pos                 (26UL)                    /*!< D26 (Bit 26)                                          */
#define LCD_RAM10_D26_Msk                 (0x4000000UL)             /*!< D26 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM10_D25_Pos                 (25UL)                    /*!< D25 (Bit 25)                                          */
#define LCD_RAM10_D25_Msk                 (0x2000000UL)             /*!< D25 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM10_D24_Pos                 (24UL)                    /*!< D24 (Bit 24)                                          */
#define LCD_RAM10_D24_Msk                 (0x1000000UL)             /*!< D24 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM10_D23_Pos                 (23UL)                    /*!< D23 (Bit 23)                                          */
#define LCD_RAM10_D23_Msk                 (0x800000UL)              /*!< D23 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM10_D22_Pos                 (22UL)                    /*!< D22 (Bit 22)                                          */
#define LCD_RAM10_D22_Msk                 (0x400000UL)              /*!< D22 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM10_D21_Pos                 (21UL)                    /*!< D21 (Bit 21)                                          */
#define LCD_RAM10_D21_Msk                 (0x200000UL)              /*!< D21 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM10_D20_Pos                 (20UL)                    /*!< D20 (Bit 20)                                          */
#define LCD_RAM10_D20_Msk                 (0x100000UL)              /*!< D20 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM10_D19_Pos                 (19UL)                    /*!< D19 (Bit 19)                                          */
#define LCD_RAM10_D19_Msk                 (0x80000UL)               /*!< D19 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM10_D18_Pos                 (18UL)                    /*!< D18 (Bit 18)                                          */
#define LCD_RAM10_D18_Msk                 (0x40000UL)               /*!< D18 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM10_D17_Pos                 (17UL)                    /*!< D17 (Bit 17)                                          */
#define LCD_RAM10_D17_Msk                 (0x20000UL)               /*!< D17 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM10_D16_Pos                 (16UL)                    /*!< D16 (Bit 16)                                          */
#define LCD_RAM10_D16_Msk                 (0x10000UL)               /*!< D16 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM10_D15_Pos                 (15UL)                    /*!< D15 (Bit 15)                                          */
#define LCD_RAM10_D15_Msk                 (0x8000UL)                /*!< D15 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM10_D14_Pos                 (14UL)                    /*!< D14 (Bit 14)                                          */
#define LCD_RAM10_D14_Msk                 (0x4000UL)                /*!< D14 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM10_D13_Pos                 (13UL)                    /*!< D13 (Bit 13)                                          */
#define LCD_RAM10_D13_Msk                 (0x2000UL)                /*!< D13 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM10_D12_Pos                 (12UL)                    /*!< D12 (Bit 12)                                          */
#define LCD_RAM10_D12_Msk                 (0x1000UL)                /*!< D12 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM10_D11_Pos                 (11UL)                    /*!< D11 (Bit 11)                                          */
#define LCD_RAM10_D11_Msk                 (0x800UL)                 /*!< D11 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM10_D10_Pos                 (10UL)                    /*!< D10 (Bit 10)                                          */
#define LCD_RAM10_D10_Msk                 (0x400UL)                 /*!< D10 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM10_D9_Pos                  (9UL)                     /*!< D9 (Bit 9)                                            */
#define LCD_RAM10_D9_Msk                  (0x200UL)                 /*!< D9 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM10_D8_Pos                  (8UL)                     /*!< D8 (Bit 8)                                            */
#define LCD_RAM10_D8_Msk                  (0x100UL)                 /*!< D8 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM10_D7_Pos                  (7UL)                     /*!< D7 (Bit 7)                                            */
#define LCD_RAM10_D7_Msk                  (0x80UL)                  /*!< D7 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM10_D6_Pos                  (6UL)                     /*!< D6 (Bit 6)                                            */
#define LCD_RAM10_D6_Msk                  (0x40UL)                  /*!< D6 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM10_D5_Pos                  (5UL)                     /*!< D5 (Bit 5)                                            */
#define LCD_RAM10_D5_Msk                  (0x20UL)                  /*!< D5 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM10_D4_Pos                  (4UL)                     /*!< D4 (Bit 4)                                            */
#define LCD_RAM10_D4_Msk                  (0x10UL)                  /*!< D4 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM10_D3_Pos                  (3UL)                     /*!< D3 (Bit 3)                                            */
#define LCD_RAM10_D3_Msk                  (0x8UL)                   /*!< D3 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM10_D2_Pos                  (2UL)                     /*!< D2 (Bit 2)                                            */
#define LCD_RAM10_D2_Msk                  (0x4UL)                   /*!< D2 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM10_D1_Pos                  (1UL)                     /*!< D1 (Bit 1)                                            */
#define LCD_RAM10_D1_Msk                  (0x2UL)                   /*!< D1 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM10_D0_Pos                  (0UL)                     /*!< D0 (Bit 0)                                            */
#define LCD_RAM10_D0_Msk                  (0x1UL)                   /*!< D0 (Bitfield-Mask: 0x01)                              */
/* =========================================================  RAM11  ========================================================= */
#define LCD_RAM11_D31_Pos                 (31UL)                    /*!< D31 (Bit 31)                                          */
#define LCD_RAM11_D31_Msk                 (0x80000000UL)            /*!< D31 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM11_D30_Pos                 (30UL)                    /*!< D30 (Bit 30)                                          */
#define LCD_RAM11_D30_Msk                 (0x40000000UL)            /*!< D30 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM11_D29_Pos                 (29UL)                    /*!< D29 (Bit 29)                                          */
#define LCD_RAM11_D29_Msk                 (0x20000000UL)            /*!< D29 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM11_D28_Pos                 (28UL)                    /*!< D28 (Bit 28)                                          */
#define LCD_RAM11_D28_Msk                 (0x10000000UL)            /*!< D28 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM11_D27_Pos                 (27UL)                    /*!< D27 (Bit 27)                                          */
#define LCD_RAM11_D27_Msk                 (0x8000000UL)             /*!< D27 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM11_D26_Pos                 (26UL)                    /*!< D26 (Bit 26)                                          */
#define LCD_RAM11_D26_Msk                 (0x4000000UL)             /*!< D26 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM11_D25_Pos                 (25UL)                    /*!< D25 (Bit 25)                                          */
#define LCD_RAM11_D25_Msk                 (0x2000000UL)             /*!< D25 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM11_D24_Pos                 (24UL)                    /*!< D24 (Bit 24)                                          */
#define LCD_RAM11_D24_Msk                 (0x1000000UL)             /*!< D24 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM11_D23_Pos                 (23UL)                    /*!< D23 (Bit 23)                                          */
#define LCD_RAM11_D23_Msk                 (0x800000UL)              /*!< D23 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM11_D22_Pos                 (22UL)                    /*!< D22 (Bit 22)                                          */
#define LCD_RAM11_D22_Msk                 (0x400000UL)              /*!< D22 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM11_D21_Pos                 (21UL)                    /*!< D21 (Bit 21)                                          */
#define LCD_RAM11_D21_Msk                 (0x200000UL)              /*!< D21 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM11_D20_Pos                 (20UL)                    /*!< D20 (Bit 20)                                          */
#define LCD_RAM11_D20_Msk                 (0x100000UL)              /*!< D20 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM11_D19_Pos                 (19UL)                    /*!< D19 (Bit 19)                                          */
#define LCD_RAM11_D19_Msk                 (0x80000UL)               /*!< D19 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM11_D18_Pos                 (18UL)                    /*!< D18 (Bit 18)                                          */
#define LCD_RAM11_D18_Msk                 (0x40000UL)               /*!< D18 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM11_D17_Pos                 (17UL)                    /*!< D17 (Bit 17)                                          */
#define LCD_RAM11_D17_Msk                 (0x20000UL)               /*!< D17 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM11_D16_Pos                 (16UL)                    /*!< D16 (Bit 16)                                          */
#define LCD_RAM11_D16_Msk                 (0x10000UL)               /*!< D16 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM11_D15_Pos                 (15UL)                    /*!< D15 (Bit 15)                                          */
#define LCD_RAM11_D15_Msk                 (0x8000UL)                /*!< D15 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM11_D14_Pos                 (14UL)                    /*!< D14 (Bit 14)                                          */
#define LCD_RAM11_D14_Msk                 (0x4000UL)                /*!< D14 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM11_D13_Pos                 (13UL)                    /*!< D13 (Bit 13)                                          */
#define LCD_RAM11_D13_Msk                 (0x2000UL)                /*!< D13 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM11_D12_Pos                 (12UL)                    /*!< D12 (Bit 12)                                          */
#define LCD_RAM11_D12_Msk                 (0x1000UL)                /*!< D12 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM11_D11_Pos                 (11UL)                    /*!< D11 (Bit 11)                                          */
#define LCD_RAM11_D11_Msk                 (0x800UL)                 /*!< D11 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM11_D10_Pos                 (10UL)                    /*!< D10 (Bit 10)                                          */
#define LCD_RAM11_D10_Msk                 (0x400UL)                 /*!< D10 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM11_D9_Pos                  (9UL)                     /*!< D9 (Bit 9)                                            */
#define LCD_RAM11_D9_Msk                  (0x200UL)                 /*!< D9 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM11_D8_Pos                  (8UL)                     /*!< D8 (Bit 8)                                            */
#define LCD_RAM11_D8_Msk                  (0x100UL)                 /*!< D8 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM11_D7_Pos                  (7UL)                     /*!< D7 (Bit 7)                                            */
#define LCD_RAM11_D7_Msk                  (0x80UL)                  /*!< D7 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM11_D6_Pos                  (6UL)                     /*!< D6 (Bit 6)                                            */
#define LCD_RAM11_D6_Msk                  (0x40UL)                  /*!< D6 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM11_D5_Pos                  (5UL)                     /*!< D5 (Bit 5)                                            */
#define LCD_RAM11_D5_Msk                  (0x20UL)                  /*!< D5 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM11_D4_Pos                  (4UL)                     /*!< D4 (Bit 4)                                            */
#define LCD_RAM11_D4_Msk                  (0x10UL)                  /*!< D4 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM11_D3_Pos                  (3UL)                     /*!< D3 (Bit 3)                                            */
#define LCD_RAM11_D3_Msk                  (0x8UL)                   /*!< D3 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM11_D2_Pos                  (2UL)                     /*!< D2 (Bit 2)                                            */
#define LCD_RAM11_D2_Msk                  (0x4UL)                   /*!< D2 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM11_D1_Pos                  (1UL)                     /*!< D1 (Bit 1)                                            */
#define LCD_RAM11_D1_Msk                  (0x2UL)                   /*!< D1 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM11_D0_Pos                  (0UL)                     /*!< D0 (Bit 0)                                            */
#define LCD_RAM11_D0_Msk                  (0x1UL)                   /*!< D0 (Bitfield-Mask: 0x01)                              */
/* =========================================================  RAM12  ========================================================= */
#define LCD_RAM12_D31_Pos                 (31UL)                    /*!< D31 (Bit 31)                                          */
#define LCD_RAM12_D31_Msk                 (0x80000000UL)            /*!< D31 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM12_D30_Pos                 (30UL)                    /*!< D30 (Bit 30)                                          */
#define LCD_RAM12_D30_Msk                 (0x40000000UL)            /*!< D30 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM12_D29_Pos                 (29UL)                    /*!< D29 (Bit 29)                                          */
#define LCD_RAM12_D29_Msk                 (0x20000000UL)            /*!< D29 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM12_D28_Pos                 (28UL)                    /*!< D28 (Bit 28)                                          */
#define LCD_RAM12_D28_Msk                 (0x10000000UL)            /*!< D28 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM12_D27_Pos                 (27UL)                    /*!< D27 (Bit 27)                                          */
#define LCD_RAM12_D27_Msk                 (0x8000000UL)             /*!< D27 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM12_D26_Pos                 (26UL)                    /*!< D26 (Bit 26)                                          */
#define LCD_RAM12_D26_Msk                 (0x4000000UL)             /*!< D26 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM12_D25_Pos                 (25UL)                    /*!< D25 (Bit 25)                                          */
#define LCD_RAM12_D25_Msk                 (0x2000000UL)             /*!< D25 (Bitfield-Mask: 0x01)                             */
