CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052.h
/* ==========================================================  ISR  ========================================================== */
#define LPTIM_ISR_DIR_Pos                 (7UL)                     /*!< DIR (Bit 7)                                           */
#define LPTIM_ISR_DIR_Msk                 (0x180UL)                 /*!< DIR (Bitfield-Mask: 0x03)                             */
#define LPTIM_ISR_DOWN_Pos                (6UL)                     /*!< DOWN (Bit 6)                                          */
#define LPTIM_ISR_DOWN_Msk                (0x40UL)                  /*!< DOWN (Bitfield-Mask: 0x01)                            */
#define LPTIM_ISR_UP_Pos                  (5UL)                     /*!< UP (Bit 5)                                            */
#define LPTIM_ISR_UP_Msk                  (0x20UL)                  /*!< UP (Bitfield-Mask: 0x01)                              */
#define LPTIM_ISR_ARROK_Pos               (4UL)                     /*!< ARROK (Bit 4)                                         */
#define LPTIM_ISR_ARROK_Msk               (0x10UL)                  /*!< ARROK (Bitfield-Mask: 0x01)                           */
#define LPTIM_ISR_CMPOK_Pos               (3UL)                     /*!< CMPOK (Bit 3)                                         */
#define LPTIM_ISR_CMPOK_Msk               (0x8UL)                   /*!< CMPOK (Bitfield-Mask: 0x01)                           */
#define LPTIM_ISR_EXTTRIG_Pos             (2UL)                     /*!< EXTTRIG (Bit 2)                                       */
#define LPTIM_ISR_EXTTRIG_Msk             (0x4UL)                   /*!< EXTTRIG (Bitfield-Mask: 0x01)                         */
#define LPTIM_ISR_ARRM_Pos                (1UL)                     /*!< ARRM (Bit 1)                                          */
#define LPTIM_ISR_ARRM_Msk                (0x2UL)                   /*!< ARRM (Bitfield-Mask: 0x01)                            */
#define LPTIM_ISR_CMPM_Pos                (0UL)                     /*!< CMPM (Bit 0)                                          */
#define LPTIM_ISR_CMPM_Msk                (0x1UL)                   /*!< CMPM (Bitfield-Mask: 0x01)                            */
/* ==========================================================  ICR  ========================================================== */
#define LPTIM_ICR_DOWN_Pos                (6UL)                     /*!< DOWN (Bit 6)                                          */
#define LPTIM_ICR_DOWN_Msk                (0x40UL)                  /*!< DOWN (Bitfield-Mask: 0x01)                            */
#define LPTIM_ICR_UP_Pos                  (5UL)                     /*!< UP (Bit 5)                                            */
#define LPTIM_ICR_UP_Msk                  (0x20UL)                  /*!< UP (Bitfield-Mask: 0x01)                              */
#define LPTIM_ICR_ARROK_Pos               (4UL)                     /*!< ARROK (Bit 4)                                         */
#define LPTIM_ICR_ARROK_Msk               (0x10UL)                  /*!< ARROK (Bitfield-Mask: 0x01)                           */
#define LPTIM_ICR_CMPOK_Pos               (3UL)                     /*!< CMPOK (Bit 3)                                         */
#define LPTIM_ICR_CMPOK_Msk               (0x8UL)                   /*!< CMPOK (Bitfield-Mask: 0x01)                           */
#define LPTIM_ICR_EXTTRIG_Pos             (2UL)                     /*!< EXTTRIG (Bit 2)                                       */
#define LPTIM_ICR_EXTTRIG_Msk             (0x4UL)                   /*!< EXTTRIG (Bitfield-Mask: 0x01)                         */
#define LPTIM_ICR_ARRM_Pos                (1UL)                     /*!< ARRM (Bit 1)                                          */
#define LPTIM_ICR_ARRM_Msk                (0x2UL)                   /*!< ARRM (Bitfield-Mask: 0x01)                            */
#define LPTIM_ICR_CMPM_Pos                (0UL)                     /*!< CMPM (Bit 0)                                          */
#define LPTIM_ICR_CMPM_Msk                (0x1UL)                   /*!< CMPM (Bitfield-Mask: 0x01)                            */
/* ==========================================================  IER  ========================================================== */
#define LPTIM_IER_DOWN_Pos                (6UL)                     /*!< DOWN (Bit 6)                                          */
#define LPTIM_IER_DOWN_Msk                (0x40UL)                  /*!< DOWN (Bitfield-Mask: 0x01)                            */
#define LPTIM_IER_UP_Pos                  (5UL)                     /*!< UP (Bit 5)                                            */
#define LPTIM_IER_UP_Msk                  (0x20UL)                  /*!< UP (Bitfield-Mask: 0x01)                              */
#define LPTIM_IER_ARROK_Pos               (4UL)                     /*!< ARROK (Bit 4)                                         */
#define LPTIM_IER_ARROK_Msk               (0x10UL)                  /*!< ARROK (Bitfield-Mask: 0x01)                           */
#define LPTIM_IER_CMPOK_Pos               (3UL)                     /*!< CMPOK (Bit 3)                                         */
#define LPTIM_IER_CMPOK_Msk               (0x8UL)                   /*!< CMPOK (Bitfield-Mask: 0x01)                           */
#define LPTIM_IER_EXTTRIG_Pos             (2UL)                     /*!< EXTTRIG (Bit 2)                                       */
#define LPTIM_IER_EXTTRIG_Msk             (0x4UL)                   /*!< EXTTRIG (Bitfield-Mask: 0x01)                         */
#define LPTIM_IER_ARRM_Pos                (1UL)                     /*!< ARRM (Bit 1)                                          */
#define LPTIM_IER_ARRM_Msk                (0x2UL)                   /*!< ARRM (Bitfield-Mask: 0x01)                            */
#define LPTIM_IER_CMPM_Pos                (0UL)                     /*!< CMPM (Bit 0)                                          */
#define LPTIM_IER_CMPM_Msk                (0x1UL)                   /*!< CMPM (Bitfield-Mask: 0x01)                            */
/* =========================================================  CFGR  ========================================================== */
#define LPTIM_CFGR_ICLKSRC_Pos            (25UL)                    /*!< ICLKSRC (Bit 25)                                      */
#define LPTIM_CFGR_ICLKSRC_Msk            (0x6000000UL)             /*!< ICLKSRC (Bitfield-Mask: 0x03)                         */
#define LPTIM_CFGR_ENC_Pos                (24UL)                    /*!< ENC (Bit 24)                                          */
#define LPTIM_CFGR_ENC_Msk                (0x1000000UL)             /*!< ENC (Bitfield-Mask: 0x01)                             */
#define LPTIM_CFGR_COUNTMD_Pos            (23UL)                    /*!< COUNTMD (Bit 23)                                      */
#define LPTIM_CFGR_COUNTMD_Msk            (0x800000UL)              /*!< COUNTMD (Bitfield-Mask: 0x01)                         */
#define LPTIM_CFGR_PRELOAD_Pos            (22UL)                    /*!< PRELOAD (Bit 22)                                      */
#define LPTIM_CFGR_PRELOAD_Msk            (0x400000UL)              /*!< PRELOAD (Bitfield-Mask: 0x01)                         */
#define LPTIM_CFGR_WAVPOL_Pos             (21UL)                    /*!< WAVPOL (Bit 21)                                       */
#define LPTIM_CFGR_WAVPOL_Msk             (0x200000UL)              /*!< WAVPOL (Bitfield-Mask: 0x01)                          */
#define LPTIM_CFGR_WAVE_Pos               (20UL)                    /*!< WAVE (Bit 20)                                         */
#define LPTIM_CFGR_WAVE_Msk               (0x100000UL)              /*!< WAVE (Bitfield-Mask: 0x01)                            */
#define LPTIM_CFGR_TIMOUT_Pos             (19UL)                    /*!< TIMOUT (Bit 19)                                       */
#define LPTIM_CFGR_TIMOUT_Msk             (0x80000UL)               /*!< TIMOUT (Bitfield-Mask: 0x01)                          */
#define LPTIM_CFGR_TRIGEN_Pos             (17UL)                    /*!< TRIGEN (Bit 17)                                       */
#define LPTIM_CFGR_TRIGEN_Msk             (0x60000UL)               /*!< TRIGEN (Bitfield-Mask: 0x03)                          */
#define LPTIM_CFGR_TRIGSEL_Pos            (13UL)                    /*!< TRIGSEL (Bit 13)                                      */
#define LPTIM_CFGR_TRIGSEL_Msk            (0xe000UL)                /*!< TRIGSEL (Bitfield-Mask: 0x07)                         */
#define LPTIM_CFGR_PRS_Pos                (9UL)                     /*!< PRS (Bit 9)                                           */
#define LPTIM_CFGR_PRS_Msk                (0xe00UL)                 /*!< PRS (Bitfield-Mask: 0x07)                             */
#define LPTIM_CFGR_TRIGFLT_Pos            (6UL)                     /*!< TRIGFLT (Bit 6)                                       */
#define LPTIM_CFGR_TRIGFLT_Msk            (0xc0UL)                  /*!< TRIGFLT (Bitfield-Mask: 0x03)                         */
#define LPTIM_CFGR_CHFLT_Pos              (3UL)                     /*!< CHFLT (Bit 3)                                         */
#define LPTIM_CFGR_CHFLT_Msk              (0x18UL)                  /*!< CHFLT (Bitfield-Mask: 0x03)                           */
#define LPTIM_CFGR_ENCMD_CKPOL_Pos        (1UL)                     /*!< ENCMD_CKPOL (Bit 1)                                   */
#define LPTIM_CFGR_ENCMD_CKPOL_Msk        (0x6UL)                   /*!< ENCMD_CKPOL (Bitfield-Mask: 0x03)                     */
#define LPTIM_CFGR_CKSEL_Pos              (0UL)                     /*!< CKSEL (Bit 0)                                         */
#define LPTIM_CFGR_CKSEL_Msk              (0x1UL)                   /*!< CKSEL (Bitfield-Mask: 0x01)                           */
/* ==========================================================  CR  =========================================================== */
#define LPTIM_CR_ARST_Pos                 (4UL)                     /*!< ARST (Bit 4)                                          */
#define LPTIM_CR_ARST_Msk                 (0x10UL)                  /*!< ARST (Bitfield-Mask: 0x01)                            */
#define LPTIM_CR_SRST_Pos                 (3UL)                     /*!< SRST (Bit 3)                                          */
#define LPTIM_CR_SRST_Msk                 (0x8UL)                   /*!< SRST (Bitfield-Mask: 0x01)                            */
#define LPTIM_CR_CNTSTART_Pos             (2UL)                     /*!< CNTSTART (Bit 2)                                      */
#define LPTIM_CR_CNTSTART_Msk             (0x4UL)                   /*!< CNTSTART (Bitfield-Mask: 0x01)                        */
#define LPTIM_CR_SNGSTART_Pos             (1UL)                     /*!< SNGSTART (Bit 1)                                      */
#define LPTIM_CR_SNGSTART_Msk             (0x2UL)                   /*!< SNGSTART (Bitfield-Mask: 0x01)                        */
#define LPTIM_CR_EN_Pos                   (0UL)                     /*!< EN (Bit 0)                                            */
#define LPTIM_CR_EN_Msk                   (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ==========================================================  CMP  ========================================================== */
#define LPTIM_CMP_CMP_Pos                 (0UL)                     /*!< CMP (Bit 0)                                           */
#define LPTIM_CMP_CMP_Msk                 (0xffffUL)                /*!< CMP (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  ARR  ========================================================== */
#define LPTIM_ARR_ARR_Pos                 (0UL)                     /*!< ARR (Bit 0)                                           */
#define LPTIM_ARR_ARR_Msk                 (0xffffUL)                /*!< ARR (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  CNT  ========================================================== */
#define LPTIM_CNT_CNT_Pos                 (0UL)                     /*!< CNT (Bit 0)                                           */
#define LPTIM_CNT_CNT_Msk                 (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */


/* =========================================================================================================================== */
/* ================                                            LVD                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR0  ========================================================== */
#define LVD_CR0_IE_Pos                    (9UL)                     /*!< IE (Bit 9)                                            */
#define LVD_CR0_IE_Msk                    (0x200UL)                 /*!< IE (Bitfield-Mask: 0x01)                              */
#define LVD_CR0_VTH_Pos                   (4UL)                     /*!< VTH (Bit 4)                                           */
#define LVD_CR0_VTH_Msk                   (0xf0UL)                  /*!< VTH (Bitfield-Mask: 0x0f)                             */
#define LVD_CR0_SOURCE_Pos                (2UL)                     /*!< SOURCE (Bit 2)                                        */
#define LVD_CR0_SOURCE_Msk                (0xcUL)                   /*!< SOURCE (Bitfield-Mask: 0x03)                          */
#define LVD_CR0_ACTION_Pos                (1UL)                     /*!< ACTION (Bit 1)                                        */
#define LVD_CR0_ACTION_Msk                (0x2UL)                   /*!< ACTION (Bitfield-Mask: 0x01)                          */
#define LVD_CR0_EN_Pos                    (0UL)                     /*!< EN (Bit 0)                                            */
#define LVD_CR0_EN_Msk                    (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ==========================================================  CR1  ========================================================== */
#define LVD_CR1_LEVEL_Pos                 (7UL)                     /*!< LEVEL (Bit 7)                                         */
#define LVD_CR1_LEVEL_Msk                 (0x80UL)                  /*!< LEVEL (Bitfield-Mask: 0x01)                           */
#define LVD_CR1_FALL_Pos                  (6UL)                     /*!< FALL (Bit 6)                                          */
#define LVD_CR1_FALL_Msk                  (0x40UL)                  /*!< FALL (Bitfield-Mask: 0x01)                            */
#define LVD_CR1_RISE_Pos                  (5UL)                     /*!< RISE (Bit 5)                                          */
#define LVD_CR1_RISE_Msk                  (0x20UL)                  /*!< RISE (Bitfield-Mask: 0x01)                            */
#define LVD_CR1_FLTCLK_Pos                (4UL)                     /*!< FLTCLK (Bit 4)                                        */
#define LVD_CR1_FLTCLK_Msk                (0x10UL)                  /*!< FLTCLK (Bitfield-Mask: 0x01)                          */
#define LVD_CR1_FLTTIME_Pos               (1UL)                     /*!< FLTTIME (Bit 1)                                       */
#define LVD_CR1_FLTTIME_Msk               (0xeUL)                   /*!< FLTTIME (Bitfield-Mask: 0x07)                         */
#define LVD_CR1_FLTEN_Pos                 (0UL)                     /*!< FLTEN (Bit 0)                                         */
#define LVD_CR1_FLTEN_Msk                 (0x1UL)                   /*!< FLTEN (Bitfield-Mask: 0x01)                           */
/* ==========================================================  SR  =========================================================== */
#define LVD_SR_FLTV_Pos                   (1UL)                     /*!< FLTV (Bit 1)                                          */
#define LVD_SR_FLTV_Msk                   (0x2UL)                   /*!< FLTV (Bitfield-Mask: 0x01)                            */
#define LVD_SR_INTF_Pos                   (0UL)                     /*!< INTF (Bit 0)                                          */
#define LVD_SR_INTF_Msk                   (0x1UL)                   /*!< INTF (Bitfield-Mask: 0x01)                            */


/* =========================================================================================================================== */
/* ================                                            RAM                                            ================ */
/* =========================================================================================================================== */

