CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052.h
/* ==========================================================  CR1  ========================================================== */
#define UARTx_CR1_BRKLEN_Pos              (12UL)                    /*!< BRKLEN (Bit 12)                                       */
#define UARTx_CR1_BRKLEN_Msk              (0x1000UL)                /*!< BRKLEN (Bitfield-Mask: 0x01)                          */
#define UARTx_CR1_TXBRK_Pos               (11UL)                    /*!< TXBRK (Bit 11)                                        */
#define UARTx_CR1_TXBRK_Msk               (0x800UL)                 /*!< TXBRK (Bitfield-Mask: 0x01)                           */
#define UARTx_CR1_OVER_Pos                (9UL)                     /*!< OVER (Bit 9)                                          */
#define UARTx_CR1_OVER_Msk                (0x600UL)                 /*!< OVER (Bitfield-Mask: 0x03)                            */
#define UARTx_CR1_START_Pos               (8UL)                     /*!< START (Bit 8)                                         */
#define UARTx_CR1_START_Msk               (0x100UL)                 /*!< START (Bitfield-Mask: 0x01)                           */
#define UARTx_CR1_LINEN_Pos               (7UL)                     /*!< LINEN (Bit 7)                                         */
#define UARTx_CR1_LINEN_Msk               (0x80UL)                  /*!< LINEN (Bitfield-Mask: 0x01)                           */
#define UARTx_CR1_SYNC_Pos                (6UL)                     /*!< SYNC (Bit 6)                                          */
#define UARTx_CR1_SYNC_Msk                (0x40UL)                  /*!< SYNC (Bitfield-Mask: 0x01)                            */
#define UARTx_CR1_STOP_Pos                (4UL)                     /*!< STOP (Bit 4)                                          */
#define UARTx_CR1_STOP_Msk                (0x30UL)                  /*!< STOP (Bitfield-Mask: 0x03)                            */
#define UARTx_CR1_PARITY_Pos              (2UL)                     /*!< PARITY (Bit 2)                                        */
#define UARTx_CR1_PARITY_Msk              (0xcUL)                   /*!< PARITY (Bitfield-Mask: 0x03)                          */
#define UARTx_CR1_RXEN_Pos                (1UL)                     /*!< RXEN (Bit 1)                                          */
#define UARTx_CR1_RXEN_Msk                (0x2UL)                   /*!< RXEN (Bitfield-Mask: 0x01)                            */
#define UARTx_CR1_TXEN_Pos                (0UL)                     /*!< TXEN (Bit 0)                                          */
#define UARTx_CR1_TXEN_Msk                (0x1UL)                   /*!< TXEN (Bitfield-Mask: 0x01)                            */
/* ==========================================================  CR2  ========================================================== */
#define UARTx_CR2_TIMCR_Pos               (10UL)                    /*!< TIMCR (Bit 10)                                        */
#define UARTx_CR2_TIMCR_Msk               (0x1c00UL)                /*!< TIMCR (Bitfield-Mask: 0x07)                           */
#define UARTx_CR2_SOURCE_Pos               (8UL)                     /*!< SORCE (Bit 8)                                         */
#define UARTx_CR2_SOURCE_Msk               (0x300UL)                 /*!< SORCE (Bitfield-Mask: 0x03)                           */
#define UARTx_CR2_DMATX_Pos               (7UL)                     /*!< DMATX (Bit 7)                                         */
#define UARTx_CR2_DMATX_Msk               (0x80UL)                  /*!< DMATX (Bitfield-Mask: 0x01)                           */
#define UARTx_CR2_DMARX_Pos               (6UL)                     /*!< DMARX (Bit 6)                                         */
#define UARTx_CR2_DMARX_Msk               (0x40UL)                  /*!< DMARX (Bitfield-Mask: 0x01)                           */
#define UARTx_CR2_TXINV_Pos               (5UL)                     /*!< TXINV (Bit 5)                                         */
#define UARTx_CR2_TXINV_Msk               (0x20UL)                  /*!< TXINV (Bitfield-Mask: 0x01)                           */
#define UARTx_CR2_RXINV_Pos               (4UL)                     /*!< RXINV (Bit 4)                                         */
#define UARTx_CR2_RXINV_Msk               (0x10UL)                  /*!< RXINV (Bitfield-Mask: 0x01)                           */
#define UARTx_CR2_RTSEN_Pos               (3UL)                     /*!< RTSEN (Bit 3)                                         */
#define UARTx_CR2_RTSEN_Msk               (0x8UL)                   /*!< RTSEN (Bitfield-Mask: 0x01)                           */
#define UARTx_CR2_CTSEN_Pos               (2UL)                     /*!< CTSEN (Bit 2)                                         */
#define UARTx_CR2_CTSEN_Msk               (0x4UL)                   /*!< CTSEN (Bitfield-Mask: 0x01)                           */
#define UARTx_CR2_SIGNAL_Pos              (1UL)                     /*!< SIGNAL (Bit 1)                                        */
#define UARTx_CR2_SIGNAL_Msk              (0x2UL)                   /*!< SIGNAL (Bitfield-Mask: 0x01)                          */
#define UARTx_CR2_ADDREN_Pos              (0UL)                     /*!< ADDREN (Bit 0)                                        */
#define UARTx_CR2_ADDREN_Msk              (0x1UL)                   /*!< ADDREN (Bitfield-Mask: 0x01)                          */
/* =========================================================  BRRI  ========================================================== */
#define UARTx_BRRI_BRRI_Pos               (0UL)                     /*!< BRRI (Bit 0)                                          */
#define UARTx_BRRI_BRRI_Msk               (0xffffUL)                /*!< BRRI (Bitfield-Mask: 0xffff)                          */
/* =========================================================  BRRF  ========================================================== */
#define UARTx_BRRF_BRRF_Pos               (0UL)                     /*!< BRRF (Bit 0)                                          */
#define UARTx_BRRF_BRRF_Msk               (0xfUL)                   /*!< BRRF (Bitfield-Mask: 0x0f)                            */
/* ========================================================  TIMARR  ========================================================= */
#define UARTx_TIMARR_TIMARR_Pos           (0UL)                     /*!< TIMARR (Bit 0)                                        */
#define UARTx_TIMARR_TIMARR_Msk           (0xffffffUL)              /*!< TIMARR (Bitfield-Mask: 0xffffff)                      */
/* ========================================================  TIMCNT  ========================================================= */
#define UARTx_TIMCNT_TIMCNT_Pos           (0UL)                     /*!< TIMCNT (Bit 0)                                        */
#define UARTx_TIMCNT_TIMCNT_Msk           (0xffffffUL)              /*!< TIMCNT (Bitfield-Mask: 0xffffff)                      */
/* ==========================================================  TDR  ========================================================== */
#define UARTx_TDR_TDR_Pos                 (0UL)                     /*!< TDR (Bit 0)                                           */
#define UARTx_TDR_TDR_Msk                 (0x1ffUL)                 /*!< TDR (Bitfield-Mask: 0x1ff)                            */
/* ==========================================================  RDR  ========================================================== */
#define UARTx_RDR_RDR_Pos                 (0UL)                     /*!< RDR (Bit 0)                                           */
#define UARTx_RDR_RDR_Msk                 (0x1ffUL)                 /*!< RDR (Bitfield-Mask: 0x1ff)                            */
/* ==========================================================  IER  ========================================================== */
#define UARTx_IER_RXBRK_Pos               (11UL)                    /*!< RXBRK (Bit 11)                                        */
#define UARTx_IER_RXBRK_Msk               (0x800UL)                 /*!< RXBRK (Bitfield-Mask: 0x01)                           */
#define UARTx_IER_BAUD_Pos                (10UL)                    /*!< BAUD (Bit 10)                                         */
#define UARTx_IER_BAUD_Msk                (0x400UL)                 /*!< BAUD (Bitfield-Mask: 0x01)                            */
#define UARTx_IER_TIMOV_Pos               (9UL)                     /*!< TIMOV (Bit 9)                                         */
#define UARTx_IER_TIMOV_Msk               (0x200UL)                 /*!< TIMOV (Bitfield-Mask: 0x01)                           */
#define UARTx_IER_CTS_Pos                 (6UL)                     /*!< CTS (Bit 6)                                           */
#define UARTx_IER_CTS_Msk                 (0x40UL)                  /*!< CTS (Bitfield-Mask: 0x01)                             */
#define UARTx_IER_PE_Pos                  (4UL)                     /*!< PE (Bit 4)                                            */
#define UARTx_IER_PE_Msk                  (0x10UL)                  /*!< PE (Bitfield-Mask: 0x01)                              */
#define UARTx_IER_FE_Pos                  (3UL)                     /*!< FE (Bit 3)                                            */
#define UARTx_IER_FE_Msk                  (0x8UL)                   /*!< FE (Bitfield-Mask: 0x01)                              */
#define UARTx_IER_RC_Pos                  (2UL)                     /*!< RC (Bit 2)                                            */
#define UARTx_IER_RC_Msk                  (0x4UL)                   /*!< RC (Bitfield-Mask: 0x01)                              */
#define UARTx_IER_TC_Pos                  (1UL)                     /*!< TC (Bit 1)                                            */
#define UARTx_IER_TC_Msk                  (0x2UL)                   /*!< TC (Bitfield-Mask: 0x01)                              */
#define UARTx_IER_TXE_Pos                 (0UL)                     /*!< TXE (Bit 0)                                           */
#define UARTx_IER_TXE_Msk                 (0x1UL)                   /*!< TXE (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ISR  ========================================================== */
#define UARTx_ISR_RXBRK_Pos               (11UL)                    /*!< RXBRK (Bit 11)                                        */
#define UARTx_ISR_RXBRK_Msk               (0x800UL)                 /*!< RXBRK (Bitfield-Mask: 0x01)                           */
#define UARTx_ISR_BAUD_Pos                (10UL)                    /*!< BAUD (Bit 10)                                         */
#define UARTx_ISR_BAUD_Msk                (0x400UL)                 /*!< BAUD (Bitfield-Mask: 0x01)                            */
#define UARTx_ISR_TIMOV_Pos               (9UL)                     /*!< TIMOV (Bit 9)                                         */
#define UARTx_ISR_TIMOV_Msk               (0x200UL)                 /*!< TIMOV (Bitfield-Mask: 0x01)                           */
#define UARTx_ISR_TXBUSY_Pos              (8UL)                     /*!< TXBUSY (Bit 8)                                        */
#define UARTx_ISR_TXBUSY_Msk              (0x100UL)                 /*!< TXBUSY (Bitfield-Mask: 0x01)                          */
#define UARTx_ISR_CTSLV_Pos               (7UL)                     /*!< CTSLV (Bit 7)                                         */
#define UARTx_ISR_CTSLV_Msk               (0x80UL)                  /*!< CTSLV (Bitfield-Mask: 0x01)                           */
#define UARTx_ISR_CTS_Pos                 (6UL)                     /*!< CTS (Bit 6)                                           */
#define UARTx_ISR_CTS_Msk                 (0x40UL)                  /*!< CTS (Bitfield-Mask: 0x01)                             */
#define UARTx_ISR_MATCH_Pos               (5UL)                     /*!< MATCH (Bit 5)                                         */
#define UARTx_ISR_MATCH_Msk               (0x20UL)                  /*!< MATCH (Bitfield-Mask: 0x01)                           */
#define UARTx_ISR_PE_Pos                  (4UL)                     /*!< PE (Bit 4)                                            */
#define UARTx_ISR_PE_Msk                  (0x10UL)                  /*!< PE (Bitfield-Mask: 0x01)                              */
#define UARTx_ISR_FE_Pos                  (3UL)                     /*!< FE (Bit 3)                                            */
#define UARTx_ISR_FE_Msk                  (0x8UL)                   /*!< FE (Bitfield-Mask: 0x01)                              */
#define UARTx_ISR_RC_Pos                  (2UL)                     /*!< RC (Bit 2)                                            */
#define UARTx_ISR_RC_Msk                  (0x4UL)                   /*!< RC (Bitfield-Mask: 0x01)                              */
#define UARTx_ISR_TC_Pos                  (1UL)                     /*!< TC (Bit 1)                                            */
#define UARTx_ISR_TC_Msk                  (0x2UL)                   /*!< TC (Bitfield-Mask: 0x01)                              */
#define UARTx_ISR_TXE_Pos                 (0UL)                     /*!< TXE (Bit 0)                                           */
#define UARTx_ISR_TXE_Msk                 (0x1UL)                   /*!< TXE (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ICR  ========================================================== */
#define UARTx_ICR_RXBRK_Pos               (11UL)                    /*!< RXBRK (Bit 11)                                        */
#define UARTx_ICR_RXBRK_Msk               (0x800UL)                 /*!< RXBRK (Bitfield-Mask: 0x01)                           */
#define UARTx_ICR_BAUD_Pos                (10UL)                    /*!< BAUD (Bit 10)                                         */
#define UARTx_ICR_BAUD_Msk                (0x400UL)                 /*!< BAUD (Bitfield-Mask: 0x01)                            */
#define UARTx_ICR_TIMOV_Pos               (9UL)                     /*!< TIMOV (Bit 9)                                         */
#define UARTx_ICR_TIMOV_Msk               (0x200UL)                 /*!< TIMOV (Bitfield-Mask: 0x01)                           */
#define UARTx_ICR_CTS_Pos                 (6UL)                     /*!< CTS (Bit 6)                                           */
#define UARTx_ICR_CTS_Msk                 (0x40UL)                  /*!< CTS (Bitfield-Mask: 0x01)                             */
#define UARTx_ICR_PE_Pos                  (4UL)                     /*!< PE (Bit 4)                                            */
#define UARTx_ICR_PE_Msk                  (0x10UL)                  /*!< PE (Bitfield-Mask: 0x01)                              */
#define UARTx_ICR_FE_Pos                  (3UL)                     /*!< FE (Bit 3)                                            */
#define UARTx_ICR_FE_Msk                  (0x8UL)                   /*!< FE (Bitfield-Mask: 0x01)                              */
#define UARTx_ICR_RC_Pos                  (2UL)                     /*!< RC (Bit 2)                                            */
#define UARTx_ICR_RC_Msk                  (0x4UL)                   /*!< RC (Bitfield-Mask: 0x01)                              */
#define UARTx_ICR_TC_Pos                  (1UL)                     /*!< TC (Bit 1)                                            */
#define UARTx_ICR_TC_Msk                  (0x2UL)                   /*!< TC (Bitfield-Mask: 0x01)                              */
#define UARTx_ICR_RFU_Pos                 (0UL)                     /*!< RFU (Bit 0)                                           */
#define UARTx_ICR_RFU_Msk                 (0x1UL)                   /*!< RFU (Bitfield-Mask: 0x01)                             */
/* =========================================================  ADDR  ========================================================== */
#define UARTx_ADDR_ADDR_Pos               (0UL)                     /*!< ADDR (Bit 0)                                          */
#define UARTx_ADDR_ADDR_Msk               (0xffUL)                  /*!< ADDR (Bitfield-Mask: 0xff)                            */
/* =========================================================  MASK  ========================================================== */
#define UARTx_MASK_MASK_Pos               (0UL)                     /*!< MASK (Bit 0)                                          */
#define UARTx_MASK_MASK_Msk               (0xffUL)                  /*!< MASK (Bitfield-Mask: 0xff)                            */


/* =========================================================================================================================== */
/* ================                                            VC                                             ================ */
/* =========================================================================================================================== */

